-----------------------------------------

走路权重 = 999
六面神石权重 = 1
----------------------------------------- 
-- 商店NPC信息
商店信息 = {}
商店信息["金创药(小)"] = {store_name = "药店", id = 1, money = 73, con = 1, pile = 99, weight = 1}
商店信息["魔法药(小)"] = {store_name = "药店", id = 2, money = 85, con = 1, pile = 99, weight = 1}
商店信息["金创药(中)"] = {store_name = "药店", id = 96, money = 146, con = 1, pile = 99, weight = 2}
商店信息["魔法药(中)"] = {store_name = "药店", id = 97, money = 170, con = 1, pile = 99, weight = 2}
商店信息["金创药(大)"] = {store_name = "药店", id = 179, money = 303, con = 1, pile = 99, weight = 3}
商店信息["魔法药(大)"] = {store_name = "药店", id = 180, money = 363, con = 1, pile = 99, weight = 3}
商店信息["金创药(特)"] = {store_name = "药店", id = 785, money = 726, con = 1, pile = 99, weight = 4}
商店信息["魔法药(特)"] = {store_name = "药店", id = 787, money = 847, con = 1, pile = 99, weight = 4}
商店信息["急救丸(小)"] = {store_name = "药店", id = 1282, money = 242, con = 1, pile = 99, weight = 1}
商店信息["清心丸(小)"] = {store_name = "药店", id = 1286, money = 291, con = 1, pile = 99, weight = 1}
商店信息["急救丸(中)"] = {store_name = "药店", id = 1283, money = 605, con = 1, pile = 99, weight = 1}
商店信息["清心丸(中)"] = {store_name = "药店", id = 1287, money = 726, con = 1, pile = 99, weight = 1}
商店信息["随机传送卷"] = {store_name = "杂货店", id = 164, money = 121, con = 1, pile = 99, weight = 1}
商店信息["回城卷"] = {store_name = "杂货店", id = 134, money = 605, con = 1, pile = 99, weight = 1}
商店信息["行会回城卷"] = {store_name = "杂货店", id = 177, money = 1210, con = 1, pile = 99, weight = 1}
商店信息["护身符(小)"] = {store_name = "杂货店", id = 104, money = 605, con = 100, pile = 1, weight = 1}
商店信息["护身符(中)"] = {store_name = "杂货店", id = 810, money = 3630, con = 200, pile = 1, weight = 3}
商店信息["护身符(大)"] = {store_name = "杂货店", id = 1004, money = 9075, con = 500, pile = 1, weight = 3}
商店信息["灵魂护身符(小)"] = {store_name = "杂货店", id = 811, money = 36300, con = 10, pile = 1, weight = 2}
商店信息["灵魂护身符(中)"] = {store_name = "杂货店", id = 812, money = 119790, con = 20, pile = 1, weight = 5}
商店信息["灰色药粉(小)"] = {store_name = "杂货店", id = 44, money = 1100, con = 50, pile = 1, weight = 1}
商店信息["黄色药粉(小)"] = {store_name = "杂货店", id = 45, money = 1100, con = 50, pile = 1, weight = 1}
商店信息["灰色药粉(中)"] = {store_name = "杂货店", id = 50, money = 2420, con = 100, pile = 1, weight = 2}
商店信息["黄色药粉(中)"] = {store_name = "杂货店", id = 52, money = 2420, con = 100, pile = 1, weight = 2}
商店信息["烧酒"] = {store_name = "客栈", id = 314, money = 25, con = 1, pile = 99, weight = 1}
商店信息["铜矿"] = {store_name = "武器店", id = 129, money = 22, con = 1, pile = 1, weight = 4}
商店信息["青铜斧"] = {store_name = "武器店", id = 20, money = 550, con = 1, pile = 1, weight = 20}
商店信息["半月"] = {store_name = "武器店", id = 67, money = 550, con = 1, pile = 1, weight = 13}
商店信息["海魂"] = {store_name = "武器店", id = 33, money = 550, con = 1, pile = 1, weight = 10}

商店信息["紫色药粉(小)"] = {store_name = "杂货店", id = 56212, money = 2750, con = 50, pile = 1, weight = 1}
商店信息["紫色药粉(中)"] = {store_name = "杂货店", id = 56216, money = 5500, con = 100, pile = 1, weight = 2}
商店信息["紫色药粉(大)"] = {store_name = "杂货店", id = 56217, money = 11000, con = 300, pile = 1, weight = 3}

商店信息["火焰护身符"] = {store_name = "杂货店", id = 56175, money = 20000, con = 500, pile = 1, weight = 1}
商店信息["寒气护身符"] = {store_name = "杂货店", id = 56176, money = 20000, con = 500, pile = 1, weight = 1}
商店信息["霹雷护身符"] = {store_name = "杂货店", id = 56177, money = 20000, con = 500, pile = 1, weight = 1}
商店信息["狂风护身符"] = {store_name = "杂货店", id = 56178, money = 20000, con = 500, pile = 1, weight = 1}
商店信息["神圣护身符"] = {store_name = "杂货店", id = 56179, money = 20000, con = 500, pile = 1, weight = 1}
商店信息["暗黑护身符"] = {store_name = "杂货店", id = 56180, money = 20000, con = 500, pile = 1, weight = 1}
商店信息["幻影护身符"] = {store_name = "杂货店", id = 56181, money = 20000, con = 500, pile = 1, weight = 1}

------------------------------------------ 
-- 六面神石信息
六面神石 = {}
六面神石["比奇县"] = {npc = "六面神石", to = "银杏村落,边境村落,道馆,蛇谷,盟重县,潘夜岛,失乐园"}
六面神石["比奇县"]["银杏村落"] = {x = 499, y = 461, index = 1}
六面神石["比奇县"]["边境村落"] = {x = 499, y = 461, index = 2}
六面神石["比奇县"]["道馆"] = {x = 499, y = 461, index = 3}
六面神石["比奇县"]["蛇谷"] = {x = 499, y = 461, index = 4}
六面神石["比奇县"]["盟重县"] = {x = 499, y = 461, index = 5}
六面神石["比奇县"]["潘夜岛"] = {x = 499, y = 461, index = 6}
六面神石["比奇县"]["失乐园"] = {x = 499, y = 461, index = 7}

六面神石["边境村落"] = {npc = "六面神石", to = "比奇县,盟重县,潘夜岛"}
六面神石["边境村落"]["比奇县"] = {x = 455, y = 217, index = 1}
六面神石["边境村落"]["盟重县"] = {x = 455, y = 217, index = 2}
六面神石["边境村落"]["潘夜岛"] = {x = 455, y = 217, index = 3}

六面神石["道馆"] = {npc = "六面神石", to = "比奇县,沙巴克,失乐园"}
六面神石["道馆"]["比奇县"] = {x = 417, y = 179, index = 1}
六面神石["道馆"]["沙巴克"] = {x = 417, y = 179, index = 2}
六面神石["道馆"]["失乐园"] = {x = 417, y = 179, index = 3}

六面神石["蛇谷"] = {npc = "六面神石", to = "比奇县,沙巴克"}
六面神石["蛇谷"]["比奇县"] = {x = 305, y = 243, index = 1}
六面神石["蛇谷"]["沙巴克"] = {x = 314, y = 197, index = 1}

六面神石["银杏村落"] = {npc = "六面神石", to = "比奇县"}
六面神石["银杏村落"]["比奇县"] = {x = 248, y = 143, index = 1}

六面神石["盟重县"] = {npc = "六面神石", to = "石阁庙,沙漠土城,沙巴克,绿洲,比奇县,边境村落,沙漠"}
六面神石["盟重县"]["石阁庙"] = {x = 349, y = 329, index = 1}
六面神石["盟重县"]["沙漠土城"] = {x = 349, y = 329, index = 2}
六面神石["盟重县"]["沙巴克"] = {x = 349, y = 329, index = 3}
六面神石["盟重县"]["绿洲"] = {x = 349, y = 329, index = 4, weight = 0.5}
六面神石["盟重县"]["比奇县"] = {x = 349, y = 329, index = 5}
六面神石["盟重县"]["边境村落"] = {x = 349, y = 329, index = 6}
六面神石["盟重县"]["沙漠"] = {x = 349, y = 329, index = 7, weight = 5}

六面神石["潘夜岛"] = {npc = "六面神石", to = "边境村落,流放岛,比奇县,潘夜石窟1层,潘夜神殿1层"}
六面神石["潘夜岛"]["边境村落"] = {x = 289, y = 242, index = 1}
六面神石["潘夜岛"]["流放岛"] = {x = 289, y = 242, index = 2}
六面神石["潘夜岛"]["比奇县"] = {x = 289, y = 242, index = 3}
六面神石["潘夜岛"]["潘夜石窟1层"] = {x = 289, y = 242, index = 4}
六面神石["潘夜岛"]["潘夜神殿1层"] = {x = 289, y = 242, index = 5}

六面神石["失乐园"] = {npc = "六面神石", to = "道馆,比奇县,沙漠土城,沙漠,本国领土"}
六面神石["失乐园"]["道馆"] = {x = 189, y = 578, index = 1}
六面神石["失乐园"]["比奇县"] = {x = 189, y = 578, index = 2}
六面神石["失乐园"]["沙漠土城"] = {x = 189, y = 578, index = 3}
六面神石["失乐园"]["沙漠"] = {x = 189, y = 578, index = 4}
六面神石["失乐园"]["本国领土"] = {x = 189, y = 578, index = 5}

六面神石["沙巴克"] = {npc = "六面神石", to = "蛇谷,沙巴克,盟重县"}
六面神石["沙巴克"]["蛇谷"] = {x = 222,  y = 159, index = 1}
六面神石["沙巴克"]["沙巴克"] = {x = 71,  y = 141, index = 1}
六面神石["沙巴克"]["盟重县"] = {x = 71,  y = 141, index = 2}

六面神石["沙漠土城"] = {npc = "六面神石", to = "失乐园,绿洲,诺玛村落,盟重县"}
六面神石["沙漠土城"]["失乐园"] = {x = 227, y = 128, index = 4}
六面神石["沙漠土城"]["绿洲"] = {x = 227, y = 128, index = 10}
六面神石["沙漠土城"]["诺玛村落"] = {x = 227, y = 128, index = 9}
六面神石["沙漠土城"]["盟重县"] = {x = 227, y = 128, index = 7}

六面神石["沙漠"] = {npc = "六面神石", to = "失乐园,绿洲,诺玛村落,盟重县"}
六面神石["沙漠"]["失乐园"] = {x = 272, y = 730, index = 1}
六面神石["沙漠"]["绿洲"] = {x = 272, y = 730, index = 2}
六面神石["沙漠"]["诺玛村落"] = {x = 272, y = 730, index = 3}
六面神石["沙漠"]["盟重县"] = {x = 272, y = 730, index = 4}

六面神石["绿洲"] = {npc = "六面神石", to = "沙漠,诺玛村落,沙漠土城,盟重县,西部沙漠"}
六面神石["绿洲"]["沙漠"] = {x = 434, y = 84, index = 1}
六面神石["绿洲"]["诺玛村落"] = {x = 434, y = 84, index = 2}
六面神石["绿洲"]["沙漠土城"] = {x = 434, y = 84, index = 3}
六面神石["绿洲"]["盟重县"] = {x = 434, y = 84, index = 4}
六面神石["绿洲"]["西部沙漠"] = {x = 434, y = 84, index = 5}

六面神石["西部沙漠"] = {npc = "六面神石", to = "绿洲"}
六面神石["西部沙漠"]["绿洲"] = {x = 95, y = 348, index = 1}

六面神石["诺玛村落"] = {npc = "六面神石", to = "绿洲,沙漠,沙漠土城"}
六面神石["诺玛村落"]["绿洲"] = {x = 183, y = 136, index = 1}
六面神石["诺玛村落"]["沙漠"] = {x = 183, y = 136, index = 2}
六面神石["诺玛村落"]["沙漠土城"] = {x = 183, y = 136, index = 3}

六面神石["石阁庙"] = {npc = "六面神石", to = "盟重县,沙漠土城"}
六面神石["石阁庙"]["盟重县"] = {x = 184, y = 91 , index = 1}
六面神石["石阁庙"]["沙漠土城"] = {x = 184, y = 91 , index = 2}

六面神石["潘夜石窟"] = {npc = "六面神石", to = "潘夜岛,潘夜神殿"}
六面神石["潘夜石窟"]["潘夜岛"] = {x = 447, y = 580, index = 1}
六面神石["潘夜石窟"]["潘夜神殿"] = {x = 447, y = 580, index = 2}

六面神石["潘夜神殿"] = {npc = "六面神石", to = "潘夜岛,潘夜石窟"}
六面神石["潘夜神殿"]["潘夜岛"] = {x = 668, y = 389, index = 1}
六面神石["潘夜神殿"]["潘夜石窟"] = {x = 668, y = 389, index = 2}

六面神石["潘夜神殿大厅"] = {npc = "六面神石", to = "潘夜神殿3层西部"}
六面神石["潘夜神殿大厅"]["潘夜神殿3层西部"] = {x = 28 , y = 31 , index = 0}

六面神石["潘夜神殿3层西部"] = {npc = "六面神石", to = "潘夜神殿大厅"}
六面神石["潘夜神殿3层西部"]["潘夜神殿大厅"] = {x = 199, y = 257, index = 0}

六面神石["潘夜神殿5层"] = {npc = "六面神石", to = "潘夜神殿大厅"}
六面神石["潘夜神殿5层"]["潘夜神殿大厅"] = {x = 219, y = 99 , index = 0}

六面神石["流放岛"] = {npc = "六面神石", to = "移动,不移动"}
六面神石["流放岛"]["移动"] = {x = 129, y = 265, index = 1}
六面神石["流放岛"]["不移动"] = {x = 129, y = 265, index = 2}

六面神石["本国领土"] = {npc = "六面神石", to = "传送至失乐园, 传送至雪原村落"}
六面神石["本国领土"]["失乐园"] = {x = 190, y = 115, index = 1}
六面神石["本国领土"]["雪原村落"] = {x= 190, y = 115, index = 2}

六面神石["雪原村落"] = {npc = "六面神石", to = "传送至本国领土, 传送至火影地牢"}
六面神石["雪原村落"]["本国领土"] = {x = 280, y = 218, index = 1}
六面神石["雪原村落"]["火影地牢1层"] = {x= 280, y = 218, index = 2}
--[[
六面神石["火影地牢"] = {npc = "六面神石", to = "雪原村落" map = "雪原村落"}
六面神石["火影地牢"]["雪原村落"] = {x = 61, y = 376, index = 1}--]]

----------------------------------------- 
-- 城镇信息，包含功能NPC坐标及名称
城市信息 = {}
城市信息["道馆"] = {}
城市信息["道馆"]["药店"] = {npc = "药店_小白", x = 393, y = 113}
城市信息["道馆"]["武器店"] = {npc = "武器店_辉哲", x = 426, y = 117}
城市信息["道馆"]["饰品店"] = {npc = "饰品店_秀翰", x = 370, y = 135}
城市信息["道馆"]["棉布店"] = {npc = "棉布店_逸赫", x = 412, y = 133}
城市信息["道馆"]["仓库"] = {npc = "仓库_升龙", x = 396, y = 117}
城市信息["道馆"]["杂货店"] = {npc = "杂货店_润燮", x = 391, y = 167}
城市信息["道馆"]["村长"] = {npc = "道馆_村长", x = 398, y = 128}
城市信息["道馆"]["贤进先生"] = {npc = "道士高手_贤进先生", x = 393, y = 135}
城市信息["道馆"]["载勋"] = {npc = "道馆侦察兵_载勋", x = 307, y = 251}
城市信息["道馆"]["京泽"] = {npc = "道馆侦察兵_京泽", x = 389, y = 249}

城市信息["道馆废矿"] = {}
城市信息["道馆废矿"]["小姚"] = {npc = "贤进先生的徒弟_小姚", x = 173, y = 16}

城市信息["秘境寻宝地图"] = {}
城市信息["秘境寻宝地图"]["秘境之门"] = {npc = "秘境之门", x = 40, y = 41}

城市信息["边境村落"] = {}
城市信息["边境村落"]["药店"] = {npc = "药店_尹老人", x = 434, y = 303}
城市信息["边境村落"]["武器店"] = {npc = "武器店_德水", x = 459, y = 279}
城市信息["边境村落"]["杂货店"] = {npc = "杂货店_郑氏", x = 433, y = 282}
城市信息["边境村落"]["饰品店"] = {npc = "饰品店_阿顺", x = 444, y = 270}
城市信息["边境村落"]["仓库"] = {npc = "仓库_赵大伯", x = 471, y = 279}
城市信息["边境村落"]["棉布店"] = {npc = "棉布店_顺子", x = 442, y = 296}
城市信息["边境村落"]["村长"] = {npc = "边境村落_村长", x = 433, y = 267}
城市信息["边境村落"]["龙血先生"] = {npc = "战士高手_龙血先生", x = 453, y = 301}
城市信息["边境村落"]["秀中"] = {npc = "边境村落侦察兵_秀中", x = 385, y = 319}
城市信息["边境村落"]["龙洙"] = {npc = "边境村落侦察兵_龙洙", x = 268, y = 247}

城市信息["边境废矿"] = {}
城市信息["边境废矿"]["小茜"] = {npc = "龙血先生的女儿_小茜", x = 173, y = 16}

城市信息["银杏村落"] = {}
城市信息["银杏村落"]["药店"] = {npc = "药店_许医生", x = 273, y = 189}
城市信息["银杏村落"]["武器店"] = {npc = "武器店_铁匠师傅", x = 284, y = 197}
城市信息["银杏村落"]["杂货店"] = {npc = "杂货店_朱老板", x = 236, y = 205}
城市信息["银杏村落"]["饰品店"] = {npc = "饰品店_宝兰", x = 275, y = 222}
城市信息["银杏村落"]["仓库"] = {npc = "仓库_文姬", x = 250, y = 190}
城市信息["银杏村落"]["棉布店"] = {npc = "棉布店_福氏", x = 260, y = 177}
城市信息["银杏村落"]["村长"] = {npc = "银杏村落_村长", x = 260, y = 205}
城市信息["银杏村落"]["霹雳尊者"] = {npc = "法师高手_霹雳尊者", x = 260, y = 205}
城市信息["银杏村落"]["尚银"] = {npc = "银杏村落侦察兵_尚银", x = 416, y = 157}
城市信息["银杏村落"]["润泽"] = {npc = "银杏村落侦察兵_润泽", x = 184, y = 302}

城市信息["银杏废矿"] = {}
城市信息["银杏废矿"]["小夕"] = {npc = "霹雳尊者的女儿_小夕", x = 173, y = 16}

城市信息["比奇县"] = {}
城市信息["比奇县"]["范围"] = {
								{x = 451, y = 266}, {x = 497, y = 341}, {x = 570, y = 384}, {x = 491, y = 430}, 
								{x = 450, y = 504}, {x = 406, y = 428}, {x = 331, y = 386}, {x = 402, y = 342},
								{x = 451, y = 266}
							 }
城市信息["比奇县"]["进城npc"] = {{x = 384, y = 319},{x = 515, y = 317},{x = 504, y = 455},{x = 388, y = 445}}
城市信息["比奇县"]["出城npc"] = {{x = 407, y = 345},{x = 493, y = 336},{x = 487, y = 420},{x = 407, y = 416}}
城市信息["比奇县"]["药店"] = {npc = "药店_银英", x = 486, y = 414}
城市信息["比奇县"]["武器店"] = {npc = "武器店_阿权", x = 423, y = 395}
城市信息["比奇县"]["杂货店"] = {npc = "杂货店_药郎", x = 450, y = 413}
城市信息["比奇县"]["饰品店"] = {npc = "饰品店_恩实", x = 414, y = 349}
城市信息["比奇县"]["仓库"] = {npc = "仓库_旅馆店员", x = 425, y = 361}
城市信息["比奇县"]["棉布店"] = {npc = "棉布店_美美", x = 480, y = 407}
城市信息["比奇县"]["总教头"] = {npc = "战士高手_总教头", x = 454, y = 438}
城市信息["比奇县"]["比奇道馆馆主"] = {npc = "比奇道馆馆主", x = 454, y = 432}
城市信息["比奇县"]["火龙坛主"] = {npc = "法师高手_火龙坛主", x = 458, y = 438}
城市信息["比奇县"]["王大人"] = {npc = "比奇巨商_王大人", x = 408, y = 378}
城市信息["比奇县"]["药剂师黄氏"] = {npc = "药店_药剂师黄氏", x = 414, y = 410}
城市信息["比奇县"]["图书管理员"] = {npc = "图书管理员", x = 471, y = 428}
城市信息["比奇县"]["志勋"] = {npc = "休班卫士_志勋", x = 415, y = 354}
城市信息["比奇县"]["京焕"] = {npc = "休班卫士_京焕", x = 447, y = 465}
城市信息["比奇县"]["宫飞孙"] = {npc = "休班卫士_宫飞孙", x = 502, y = 395}
城市信息["比奇县"]["客栈"] = {npc = "客栈_朱冒", x = 422, y = 432}
城市信息["比奇县"]["侦察兵"] = {npc = "侦察兵", x = 307, y = 326}
城市信息["比奇县"]["书店"] = {npc = "书店_成民", x = 469, y = 424}
城市信息["比奇县"]["新手关怀大使"] = {npc = "新手关怀大使", x = 448, y = 381}
城市信息["比奇县"]["每日任务"] = {npc = "每日任务_万事通", x = 451, y = 388}	-- 每日任务
城市信息["比奇县"]["占卜"] = {npc = "赛半仙", x = 451, y = 387}
城市信息["比奇县"]["秘境"] = {npc = "庆典使者", x = 449, y = 389}
城市信息["比奇县"]["声望管理员"] = {npc = "声望管理员", x = 448, y = 435}
城市信息["比奇县"]["行会管理员"] = {npc = "行会管理员_启明", x = 446, y = 436}
城市信息["比奇县"]["护卫队长"] = {npc = "护卫队长", x = 499, y = 397}
城市信息["比奇县"]["庆典使者"] = {npc = "庆典使者", x = 448, y = 389}
城市信息["比奇县"]["恶霸"] = {npc = "恶霸", x = 257, y = 405}
城市信息["比奇县"]["活动大使"] = {npc = "活动大使", x = 447, y = 392}

城市信息["比奇内城"] = {}
城市信息["比奇内城"]["比奇城主"] = {npc = "比奇城主_林夏玉", x = 43, y = 31}
城市信息["比奇内城"]["姚花"] = {npc = "姚花", x = 41, y = 29}
城市信息["比奇内城"]["内需司"] = {npc = "内需司_金正", x = 38, y = 38}

城市信息["蛇谷"] = {}
城市信息["蛇谷"]["药店"] = {npc = "药店_金大夫", x = 334, y = 234}
城市信息["蛇谷"]["武器店"] = {npc = "武器店_姜铁匠", x = 354, y = 219}
城市信息["蛇谷"]["杂货店"] = {npc = "杂货店_老江湖卢氏", x = 361, y = 226}
城市信息["蛇谷"]["仓库"] = {npc = "仓库_客栈仓库管理员", x = 346, y = 234}
城市信息["蛇谷"]["棉布店"] = {npc = "棉布店_秀美", x = 342, y = 235}
城市信息["蛇谷"]["蛇谷老人"] = {npc = "蛇谷老人", x = 343, y = 219}
城市信息["蛇谷"]["高手"] = {npc = "高手_断玉先生", x = 347, y = 193}

城市信息["盟重县"] = {}
城市信息["盟重县"]["药店"] = {npc = "药店_凌峰", x = 289, y = 289}
城市信息["盟重县"]["武器店"] = {npc = "武器店_英龙", x = 350, y =291 }
城市信息["盟重县"]["杂货店"] = {npc = "杂货店_龙叔", x = 293, y = 278}
城市信息["盟重县"]["饰品店"] = {npc = "饰品店_善英", x = 311, y = 273}
城市信息["盟重县"]["仓库"] = {npc = "仓库_丘叔", x = 321, y = 312}
城市信息["盟重县"]["棉布店"] = {npc = "棉布店_美玲", x = 324, y = 277}
城市信息["盟重县"]["每日任务"] = {npc = "每日任务_万事通", x = 323, y = 286}	-- 每日任务
城市信息["盟重县"]["占卜"] = {npc = "赛半仙", x = 299, y = 287}
城市信息["盟重县"]["老包"] = {npc = "守卫军_老包", x = 149, y = 252}
城市信息["盟重县"]["老严"] = {npc = "守卫军_老严", x = 328, y = 415}
城市信息["盟重县"]["老王"] = {npc = "守卫军_老王", x = 421, y = 193}
城市信息["盟重县"]["法师高手"] = {npc = "法师高手_雷神坛主", x = 290, y = 299}
城市信息["盟重县"]["秘境"] = {npc = "庆典使者", x = 312, y = 283}
城市信息["盟重县"]["封魔塔"] = {npc = "封魔塔", x = 398, y = 326}
城市信息["盟重县"]["声望管理员"] = {npc = "声望管理员", x = 286, y = 304}
城市信息["盟重县"]["行会管理员"] = {npc = "行会管理员_长庚", x = 286, y = 304}
城市信息["盟重县"]["活动大使"] = {npc = "活动大使", x = 306, y = 284}
城市信息["盟重县"]["天机老人"] = {npc = "天机老人", x = 316, y = 329}
城市信息["盟重县"]["庆典使者"] = {npc = "庆典使者", x = 314, y = 282}
城市信息["盟重县"]["武圣人老姜"] = {npc = "武圣人老姜", x = 325, y = 280}

城市信息["绿洲"] = {}
城市信息["绿洲"]["药店"] = {npc = "药店_贞喜", x = 430, y = 75}
城市信息["绿洲"]["武器店"] = {npc = "武器店_奇虎", x = 448, y = 76}
城市信息["绿洲"]["杂货店"] = {npc = "杂货店_润巧", x = 470, y = 67}
城市信息["绿洲"]["饰品店"] = {npc = "占卜师_梅山侠", x = 475, y = 55}
城市信息["绿洲"]["仓库"] = {npc = "仓库_流影", x = 438, y = 68}
城市信息["绿洲"]["棉布店"] = {npc = "棉布店_珍英", x = 462, y = 91}
城市信息["绿洲"]["占卜师"] = {npc = "占卜师_梅山侠", x = 474, y = 55}

城市信息["失乐园"] = {}
城市信息["失乐园"]["药店"] = {npc = "药店_幽美", x = 215, y = 527}
城市信息["失乐园"]["武器店"] = {npc = "武器店_志成", x = 196, y = 526}
城市信息["失乐园"]["杂货店"] = {npc = "杂货店_阿成", x = 199, y = 559}
城市信息["失乐园"]["饰品店"] = {npc = "饰品店_周艾", x = 190, y = 610}
城市信息["失乐园"]["仓库"] = {npc = "仓库_永宝", x =209 , y = 586}
城市信息["失乐园"]["棉布店"] = {npc = "棉布店_玄贞", x = 208, y = 624}
城市信息["失乐园"]["樵夫"] = {npc = "樵夫", x = 186, y = 558}

城市信息["潘夜岛"] = {}
城市信息["潘夜岛"]["药店"] = {npc = "药店_成赫", x = 282, y = 224}
城市信息["潘夜岛"]["武器店"] = {npc = "武器店_阿胜", x = 224, y = 210}
城市信息["潘夜岛"]["杂货店"] = {npc = "杂货店_中叔", x = 253, y = 291}
城市信息["潘夜岛"]["饰品店"] = {npc = "饰品店_晓华", x = 266, y = 285}
城市信息["潘夜岛"]["仓库"] = {npc = "仓库_满春", x = 231, y = 260}
城市信息["潘夜岛"]["棉布店"] = {npc = "棉布店_美珍", x = 249, y = 257}

城市信息["沙漠土城"] = {}
城市信息["沙漠土城"]["药店"] = {npc = "药店_京浩", x = 200, y = 237}
城市信息["沙漠土城"]["武器店"] = {npc = "武器店_仁燮", x = 189, y = 252}
城市信息["沙漠土城"]["杂货店"] = {npc = "杂货店_徐氏", x = 192, y = 232}
城市信息["沙漠土城"]["饰品店"] = {npc = "饰品店_京珠", x = 208, y = 246}
城市信息["沙漠土城"]["仓库"] = {npc = "仓库_吉雨", x = 171, y = 265}
城市信息["沙漠土城"]["棉布店"] = {npc = "棉布店_美姬", x = 177, y = 281}
城市信息["沙漠土城"]["乘龙"] = {npc = "乘龙", x = 149, y = 220}

城市信息["沙巴克"] = {}
城市信息["沙巴克"]["药店"] = {npc = "药店_晶晶", x = 204, y = 196}
城市信息["沙巴克"]["武器店"] = {npc = "武器店_老胡", x = 195, y = 183}
城市信息["沙巴克"]["杂货店"] = {npc = "杂货店_基勋", x = 229, y = 168}
城市信息["沙巴克"]["饰品店"] = {npc = "饰品店_多多", x = 211, y = 183}
城市信息["沙巴克"]["仓库"] = {npc = "仓库_惠莲", x = 214, y = 128}
城市信息["沙巴克"]["棉布店"] = {npc = "棉布店_喜儿", x = 229, y = 150}


城市信息["诺玛村落"] = {}
城市信息["诺玛村落"]["药店"] = {npc = "药店_阿尔多", x = 180, y = 80}
城市信息["诺玛村落"]["武器店"] = {npc = "武器店_陀穆尔", x = 145, y = 82}
城市信息["诺玛村落"]["杂货店"] = {npc = "杂货店_朔珑戈", x = 128, y = 119}
城市信息["诺玛村落"]["饰品店"] = {npc = "饰品店_乌莎斯", x = 154, y = 106}
城市信息["诺玛村落"]["仓库"] = {npc = "仓库_阿拉尔", x = 167, y = 85}
城市信息["诺玛村落"]["棉布店"] = {npc = "棉布店_俞珀", x = 141, y = 107}

城市信息["本国领土"] = {}
城市信息["本国领土"]["药店"] = {npc = "药店_雪封", x = 179, y = 73}
城市信息["本国领土"]["武器店"] = {npc = "武器店_雪筑", x = 172, y = 52}
城市信息["本国领土"]["杂货店"] = {npc = "杂货店_雪夜", x = 185, y = 72}
城市信息["本国领土"]["饰品店"] = {npc = "饰品店_雪莹", x = 170, y = 67}
--城市信息["本国领土"]["仓库"] = {npc = "仓库_雪叔", x = 205, y = 162}
城市信息["本国领土"]["棉布店"] = {npc = "棉布店_雪儿", x = 166, y = 78}

城市信息["雪原村落"] = {}
城市信息["雪原村落"]["药店"] = {npc = "药店_雪禄", x = 249, y = 179}
城市信息["雪原村落"]["武器店"] = {npc = "武器店_雪笛", x = 284, y = 159}
城市信息["雪原村落"]["杂货店"] = {npc = "杂货店_雪靛", x = 235, y = 141}
城市信息["雪原村落"]["饰品店"] = {npc = "饰品店_雪赫", x = 227, y = 140}
城市信息["雪原村落"]["仓库"] = {npc = "仓库_雪叔", x = 205, y = 162}
城市信息["雪原村落"]["棉布店"] = {npc = "棉布店_雪容", x = 262, y = 177}
城市信息["雪原村落"]["族长女儿"] = {npc = "族长女儿_雪姬", x = 211, y = 98}

城市信息["西部沙漠"] = {}
城市信息["西部沙漠"]["草药商"] = {npc = "草药商_李灵药", x = 136, y = 257}

----------------------------------------- 
-- 地图信息，包含过图坐标
地图信息 = {}

地图信息["潘夜岛"] = {}
地图信息["潘夜岛"]["潘夜神殿1层"] = {x = 692, y = 358, npc = ""}
地图信息["潘夜岛"]["潘夜石窟1层"] = {x = 416, y = 553, npc = "交通疏散员_老矿工", text = "确定"}

地图信息["潘夜石窟1层"] = {}
地图信息["潘夜石窟1层"]["潘夜岛"] = {x = 127, y = 173, npc = ""}
地图信息["潘夜石窟1层"]["潘夜石窟2-1层"] = {x = 10, y = 96, npc = ""}

地图信息["潘夜石窟2-1层"] = {}
地图信息["潘夜石窟2-1层"]["潘夜石窟1层"] = {x = 282, y = 62, npc = ""}
地图信息["潘夜石窟2-1层"]["潘夜石窟2-2层"] = {x = 27, y = 23, npc = ""}
地图信息["潘夜石窟2-1层"]["潘夜石窟3层"] = {x = 281, y = 258, npc = ""}

地图信息["潘夜石窟2-2层"] = {}
地图信息["潘夜石窟2-2层"]["潘夜石窟2-1层"] = {x = 80, y = 85, npc = ""}

地图信息["潘夜石窟3层"] = {}
地图信息["潘夜石窟3层"]["潘夜石窟2-1层"] = {x = 267, y = 276, npc = ""}
地图信息["潘夜石窟3层"]["潘夜石窟4层"] = {x = 107, y = 130, npc = ""}

地图信息["潘夜石窟4层"] = {}
地图信息["潘夜石窟4层"]["潘夜石窟3层"] = {x = 59, y = 285, npc = ""}
地图信息["潘夜石窟4层"]["潘夜石窟5层"] = {x = 226, y = 16, npc = ""}

地图信息["潘夜石窟5层"] = {}
地图信息["潘夜石窟5层"]["潘夜石窟4层"] = {x = 372, y = 48, npc = ""}

地图信息["潘夜神殿1层"] = {}
地图信息["潘夜神殿1层"]["潘夜岛"] = {x = 134, y = 181, npc = ""}
地图信息["潘夜神殿1层"]["潘夜神殿2层"] = {x = 222, y = 228, npc = ""}

地图信息["潘夜神殿2层"] = {}
地图信息["潘夜神殿2层"]["潘夜神殿1层"] = {x = 140, y = 140, npc = ""}
地图信息["潘夜神殿2层"]["潘夜神殿3层东部"] = {x = 51, y = 46, npc = ""}
地图信息["潘夜神殿2层"]["潘夜神殿3层西部"] = {x = 255, y = 254, npc = ""}

地图信息["潘夜神殿3层东部"] = {}
地图信息["潘夜神殿3层东部"]["潘夜神殿2层"] = {x = 36, y = 63, npc = ""}
地图信息["潘夜神殿3层东部"]["潘夜神殿4层"] = {x = 62, y = 36, npc = ""}

地图信息["潘夜神殿3层西部"] = {}
地图信息["潘夜神殿3层西部"]["潘夜神殿2层"] = {x = 206, y = 332, npc = ""}

--地图信息["潘夜神殿3层西部"]["潘夜神殿大厅"] = {x = 198, y = 256, npc = ""}

地图信息["潘夜神殿4层"] = {}
地图信息["潘夜神殿4层"]["潘夜神殿3层东部"] = {x = 107, y = 93, npc = ""}
地图信息["潘夜神殿4层"]["潘夜神殿5层"] = {x = 157, y = 152, npc = ""}

地图信息["潘夜神殿5层"] = {}
地图信息["潘夜神殿5层"]["潘夜神殿4层"] = {x = 106, y = 217, npc = ""}

地图信息["潘夜神殿大厅"] = {}
地图信息["潘夜神殿大厅"]["潘夜神殿3层西部"] = {x = 16, y = 18, npc = ""}
地图信息["潘夜神殿大厅"]["潘夜神殿6层"] = {x = 25, y = 22, npc = ""}

地图信息["潘夜神殿6层"] = {}
地图信息["潘夜神殿6层"]["潘夜神殿大厅"] = {x = 220, y = 225, npc = ""}
地图信息["潘夜神殿6层"]["潘夜神殿7层"] = {x = 111, y = 112, npc = ""}

地图信息["潘夜神殿7层"] = {}
地图信息["潘夜神殿7层"]["潘夜神殿6层"] = {x = 155, y = 156, npc = ""}
地图信息["潘夜神殿7层"]["潘夜神殿8层"] = {x = 373, y = 378, npc = ""}

地图信息["潘夜神殿8层"] = {}
地图信息["潘夜神殿8层"]["潘夜神殿7层"] = {x = 34, y = 26, npc = ""}
地图信息["潘夜神殿8层"]["潘夜神殿9层东部"] = {x = 38, y = 373, npc = ""}
地图信息["潘夜神殿8层"]["潘夜神殿9层西部"] = {x = 376, y = 50, npc = ""}
地图信息["潘夜神殿8层"]["潘夜神殿10层"] = {x = 375, y = 369, npc = ""}

地图信息["潘夜神殿10层"] = {}
地图信息["潘夜神殿10层"]["潘夜神殿8层"] = {x = 380, y = 383, npc = ""}

地图信息["潘夜神殿9层西部"] = {}
地图信息["潘夜神殿9层西部"]["潘夜神殿8层"] = {x = 39, y = 109, npc = ""}

地图信息["潘夜神殿9层东部"] = {}
地图信息["潘夜神殿9层东部"]["潘夜神殿8层"] = {x = 94, y = 128, npc = ""}


地图信息["失乐园"] = {}
地图信息["失乐园"]["道馆"] = {x = 750, y = 38, npc = ""}
地图信息["失乐园"]["黑度宫1层"] = {x = 208, y = 91, npc = ""}
地图信息["失乐园"]["南部蚂蚁洞穴1层1"] = {x = 733, y = 674, npc = ""}
地图信息["失乐园"]["真天宫地下1层"] = {x = 388, y = 305, npc = ""}
地图信息["失乐园"]["本国领土"] = {x = 30, y = 33, npc = ""}
地图信息["失乐园"]["失乐虫谷1层"] = {x = 186, y = 558, npc = "樵夫", text = "进入失乐虫谷1层（需70级以上）"}

地图信息["真天宫北馆1层"] = {}
地图信息["真天宫北馆1层"]["真天宫北馆2层"] = {x = 259, y = 35, npc = ""}
地图信息["真天宫北馆1层"]["真天宫地下1层"] = {x = 118, y = 199, npc = ""}

地图信息["真天宫北馆2层"] = {}
地图信息["真天宫北馆2层"]["真天宫北馆1层"] = {x = 121, y = 133, npc = ""}
地图信息["真天宫北馆2层"]["真天宫北馆3层"] = {x = 217, y = 285, npc = ""}

地图信息["真天宫北馆3层"] = {}
地图信息["真天宫北馆3层"]["真天宫北馆2层"] = {x = 268, y = 35, npc = ""}

地图信息["真天宫地下1层"] = {}
地图信息["真天宫地下1层"]["失乐园"] = {x = 171, y = 225, npc = ""}
地图信息["真天宫地下1层"]["真天宫北馆1层"] = {x = 355, y = 41, npc = ""}
地图信息["真天宫地下1层"]["真天宫东馆1层"] = {x = 352, y = 381, npc = ""}
地图信息["真天宫地下1层"]["真天宫南馆1层"] = {x = 27, y = 369, npc = ""}
地图信息["真天宫地下1层"]["真天宫西馆1层"] = {x = 15, y = 45, npc = ""}

地图信息["真天宫东馆1层"] = {}
地图信息["真天宫东馆1层"]["真天宫地下1层"] = {x = 39, y = 37, npc = ""}
地图信息["真天宫东馆1层"]["真天宫东馆2层"] = {x = 149, y = 152, npc = ""}

地图信息["真天宫东馆2层"] = {}
地图信息["真天宫东馆2层"]["真天宫东馆1层"] = {x = 161, y = 153, npc = ""}
地图信息["真天宫东馆2层"]["真天宫东馆3层"] = {x = 259, y = 275, npc = ""}

地图信息["真天宫东馆3层"] = {}
地图信息["真天宫东馆3层"]["黑度宫4层"] = {x = 281, y = 53, npc = ""}
地图信息["真天宫东馆3层"]["真天宫东馆2层"] = {x = 29, y = 33, npc = ""}
地图信息["真天宫东馆3层"]["真天宫东馆4层"] = {x = 286, y = 289, npc = ""}
地图信息["真天宫东馆3层"]["真天宫南馆3层"] = {x = 65, y = 205, npc = ""}

地图信息["真天宫东馆4层"] = {}
地图信息["真天宫东馆4层"]["真天宫东馆3层"] = {x = 11, y = 19, npc = ""}
地图信息["真天宫东馆4层"]["真天宫北馆4层"] = {x = 256, y = 259, npc = ""}

地图信息["真天宫北馆4层"] = {}
地图信息["真天宫北馆4层"]["真天宫东馆4层"] = {x = 21, y = 268, npc = ""}
地图信息["真天宫北馆4层"]["真天宫北馆5层"] = {x = 245, y = 20, npc = ""}

地图信息["真天宫北馆5层"] = {}
地图信息["真天宫北馆5层"]["真天宫北馆4层"] = {x = 182, y = 184, npc = ""}

地图信息["真天宫南馆1层"] = {}
地图信息["真天宫南馆1层"]["真天宫地下1层"] = {x = 241, y = 26, npc = ""}

地图信息["真天宫南馆2层"] = {}
地图信息["真天宫南馆2层"]["黑度宫3层"] = {x = 165, y = 62, npc = ""}
地图信息["真天宫南馆2层"]["真天宫南馆3层"] = {x = 246, y = 264, npc = ""}
地图信息["真天宫南馆2层"]["真天宫西馆2层"] = {x = 17, y = 17, npc = ""}

地图信息["真天宫南馆3层"] = {}
地图信息["真天宫南馆3层"]["真天宫东馆3层"] = {x = 270, y = 238, npc = ""}
地图信息["真天宫南馆3层"]["真天宫南馆2层"] = {x = 13, y = 18, npc = ""}

地图信息["真天宫西馆1层"] = {}
地图信息["真天宫西馆1层"]["真天宫地下1层"] = {x = 269, y = 91, npc = ""}
地图信息["真天宫西馆1层"]["真天宫西馆2层"] = {x = 16, y = 276, npc = ""}

地图信息["真天宫西馆2层"] = {}
地图信息["真天宫西馆2层"]["真天宫南馆2层"] = {x = 120, y = 261, npc = ""}
地图信息["真天宫西馆2层"]["真天宫西馆1层"] = {x = 243, y = 20, npc = ""}

地图信息["黑度宫1层"] = {}
地图信息["黑度宫1层"]["黑度宫2层-1"] = {x = 9, y = 172, npc = ""}
地图信息["黑度宫1层"]["黑度宫2层-2"] = {x = 189, y = 188, npc = ""}
地图信息["黑度宫1层"]["失乐园"] = {x = 13, y = 46, npc = ""}

地图信息["黑度宫2层-1"] = {}
地图信息["黑度宫2层-1"]["黑度宫1层"] = {x = 94, y = 58, npc = ""}
地图信息["黑度宫2层-1"]["黑度宫3层"] = {x = 31, y = 186, npc = ""}

地图信息["黑度宫2层-2"] = {}
地图信息["黑度宫2层-2"]["黑度宫1层"] = {x = 94, y = 58, npc = ""}
地图信息["黑度宫2层-2"]["黑度宫3层"] = {x = 30, y = 181, npc = ""}

地图信息["黑度宫3层"] = {}
地图信息["黑度宫3层"]["黑度宫2层-1"] = {x = 39, y = 22, npc = ""}
地图信息["黑度宫3层"]["黑度宫2层-2"] = {x = 187, y = 18, npc = ""}
地图信息["黑度宫3层"]["黑度宫4层"] = {x = 15, y = 186, npc = ""}
地图信息["黑度宫3层"]["真天宫南馆2层"] = {x = 184, y = 169, npc = ""}

地图信息["黑度宫4层"] = {}
地图信息["黑度宫4层"]["黑度宫3层"] = {x = 181, y = 27, npc = ""}
地图信息["黑度宫4层"]["真天宫东馆3层"] = {x = 13, y = 124, npc = ""}
地图信息["黑度宫4层"]["黑雾神殿1层"] = {x = 119, y = 188, npc = ""}

地图信息["黑雾神殿1层"] = {}
地图信息["黑雾神殿1层"]["黑度宫4层"] = {x = 179, y = 34, npc = ""}
地图信息["黑雾神殿1层"]["黑雾神殿2层"] = {x = 31, y = 186, npc = ""}

地图信息["黑雾神殿2层"] = {}
地图信息["黑雾神殿2层"]["黑雾神殿1层"] = {x = 38, y = 23, npc = ""}

地图信息["沙巴克"] = {}
地图信息["沙巴克"]["灌木林"] = {x = 33, y = 266, npc = ""}
地图信息["沙巴克"]["蛇谷"] = {x = 365, y = 574, npc = ""}
地图信息["沙巴克"]["祖玛神殿"] = {x = 351, y = 40, npc = ""}

地图信息["灌木林"] = {}
地图信息["灌木林"]["赤月山谷1层"] = {x = 46, y = 143, npc = ""}
地图信息["灌木林"]["道馆"] = {x = 123, y = 468, npc = ""}
地图信息["灌木林"]["沙巴克"] = {x = 364, y = 392, npc = ""}

地图信息["赤月山谷1层"] = {}
地图信息["赤月山谷1层"]["赤月山谷2层"] = {x = 123, y = 24, npc = ""}
地图信息["赤月山谷1层"]["灌木林"] = {x = 270, y = 385, npc = ""}

地图信息["赤月山谷2层"] = {}
地图信息["赤月山谷2层"]["赤月山谷1层"] = {x = 61, y = 289, npc = ""}
地图信息["赤月山谷2层"]["赤月山谷3层-1"] = {x = 13, y = 26, npc = ""}
地图信息["赤月山谷2层"]["赤月山谷3层-2"] = {x = 289, y = 138, npc = ""}

地图信息["赤月山谷3层-1"] = {}
地图信息["赤月山谷3层-1"]["赤月山谷2层"] = {x = 290, y = 151, npc = ""}
地图信息["赤月山谷3层-1"]["赤月山谷4层"] = {x = 149, y = 103, npc = ""}

地图信息["赤月山谷3层-2"] = {}
地图信息["赤月山谷3层-2"]["赤月山谷2层"] = {x = 9, y = 156, npc = ""}
地图信息["赤月山谷3层-2"]["赤月山谷4层"] = {x = 201, y = 148, npc = ""}

地图信息["赤月山谷4层"] = {}
地图信息["赤月山谷4层"]["赤月山谷3层-1"] = {x = 121, y = 38, npc = ""}
地图信息["赤月山谷4层"]["赤月山谷3层-2"] = {x = 170, y = 89, npc = ""}
地图信息["赤月山谷4层"]["赤月山谷5层-1"] = {x = 146, y = 110, npc = ""}
地图信息["赤月山谷4层"]["赤月山谷5层-2"] = {x = 217, y = 133, npc = ""}

地图信息["赤月山谷5层-1"] = {}
地图信息["赤月山谷5层-1"]["赤月山谷4层"] = {x = 47, y = 189, npc = ""}

地图信息["赤月山谷5层-2"] = {}
地图信息["赤月山谷5层-2"]["赤月山谷4层"] = {x = 98, y = 185, npc = ""}

地图信息["祖玛神殿"] = {}
地图信息["祖玛神殿"]["沙巴克"] = {x = 25, y = 53, npc = ""}
地图信息["祖玛神殿"]["蛇谷"] = {x = 120, y = 257, npc = ""}
地图信息["祖玛神殿"]["祖玛神殿大厅"] = {x = 175, y = 128, npc = ""}

地图信息["祖玛神殿大厅"] = {}
地图信息["祖玛神殿大厅"]["祖玛神殿"] = {x = 9, y = 27, npc = ""}
地图信息["祖玛神殿大厅"]["祖玛神殿1层"] = {x = 20, y = 15, npc = ""}

地图信息["祖玛神殿1层"] = {}
地图信息["祖玛神殿1层"]["祖玛神殿大厅"] = {x = 165, y = 217, npc = ""}
地图信息["祖玛神殿1层"]["祖玛神殿2层"] = {x = 350, y = 170, npc = ""}

地图信息["祖玛神殿2层"] = {}
地图信息["祖玛神殿2层"]["祖玛神殿1层"] = {x = 165, y = 217, npc = ""}
地图信息["祖玛神殿2层"]["祖玛神殿3层"] = {x = 112, y = 231, npc = ""}

地图信息["祖玛神殿3层"] = {}
地图信息["祖玛神殿3层"]["祖玛神殿2层"] = {x = 165, y = 217, npc = ""}
地图信息["祖玛神殿3层"]["祖玛神殿4层"] = {x = 295, y = 146, npc = ""}

地图信息["祖玛神殿4层"] = {}
地图信息["祖玛神殿4层"]["祖玛神殿3层"] = {x = 165, y = 217, npc = ""}
地图信息["祖玛神殿4层"]["祖玛神殿5层"] = {x = 51, y = 173, npc = ""}

地图信息["祖玛神殿5层"] = {}
地图信息["祖玛神殿5层"]["祖玛神殿4层"] = {x = 95, y = 102, npc = ""}
地图信息["祖玛神殿5层"]["祖玛阁"] = {x = 123, y = 10, npc = ""}

地图信息["祖玛阁"] = {}
地图信息["祖玛阁"]["祖玛神殿5层"] = {x = 7, y = 17, npc = ""}
地图信息["祖玛阁"]["祖玛神殿7层大厅"] = {x = 90, y = 76, npc = ""}

地图信息["祖玛神殿7层大厅"] = {}
地图信息["祖玛神殿7层大厅"]["祖玛阁"] = {x = 7, y = 9, npc = ""}
地图信息["祖玛神殿7层大厅"]["祖玛神殿7层"] = {x = 39, y = 43, npc = ""}

地图信息["祖玛神殿7层"] = {}
地图信息["祖玛神殿7层"]["祖玛神殿7层大厅"] = {x = 6, y = 50, npc = ""}

地图信息["蛇谷"] = {}
地图信息["蛇谷"]["北部矿山入口"] = {x = 342, y = 137, npc = ""}
地图信息["蛇谷"]["矿山1层"] = {x = 366, y = 200, npc = "交通疏散员_老矿工", text = "确定"}
地图信息["蛇谷"]["南部矿山1层"] = {x = 350, y = 261, npc = "交通疏散员_老矿工", text = "确定"}
地图信息["蛇谷"]["沙巴克"] = {x = 121, y = 58, npc = ""}
地图信息["蛇谷"]["祖玛神殿"] = {x = 356, y = 35, npc = ""}
地图信息["蛇谷"]["比奇县"] = {x = 160, y = 372, npc = ""}

地图信息["矿山1层"] = {}
地图信息["矿山1层"]["矿山2层"] = {x = 361, y = 19, npc = ""}
地图信息["矿山1层"]["蛇谷"] = {x = 30, y = 375, npc = "交通疏散员_老矿工", text = "确定"}

地图信息["矿山2层"] = {}
地图信息["矿山2层"]["矿山1层"] = {x = 22, y = 42, npc = ""}

--蛇谷北部矿山
地图信息["北部矿山入口"] = {}
地图信息["北部矿山入口"]["蛇谷"] = {x = 24, y = 182, npc = ""}
地图信息["北部矿山入口"]["北部地下1层第一间屋"] = {x = 76, y = 15, npc = ""}
地图信息["北部矿山入口"]["北部地下1层第二间屋"] = {x = 179, y = 109, npc = ""}

地图信息["北部地下1层第一间屋"] = {}
地图信息["北部地下1层第一间屋"]["北部矿山入口"] = {x = 60, y = 7, npc = ""}
地图信息["北部地下1层第一间屋"]["北部废矿南部洞穴"] = {x = 95, y = 49, npc = ""}

地图信息["北部废矿南部洞穴"] = {}
地图信息["北部废矿南部洞穴"]["北部地下1层第一间屋"] = {x = 23, y = 15, npc = ""}
地图信息["北部废矿南部洞穴"]["北部天桥1"] = {x = 186, y = 119, npc = ""}

地图信息["北部天桥1"] = {}
地图信息["北部天桥1"]["北部废矿南部洞穴"] = {x = 8, y = 86, npc = ""}
地图信息["北部天桥1"]["北部矿石储藏处"] = {x = 84, y = 16, npc = ""}

地图信息["北部矿石储藏处"] = {}
地图信息["北部矿石储藏处"]["北部天桥1"] = {x = 11, y = 148, npc = ""}
地图信息["北部矿石储藏处"]["北部天桥3"] = {x = 166, y = 138, npc = ""}

地图信息["北部天桥3"] = {}
地图信息["北部天桥3"]["北部矿石储藏处"] = {x = 6, y = 54, npc = ""}
地图信息["北部天桥3"]["北部地下2层采掘场"] = {x = 90, y = 16, npc = ""}

地图信息["北部地下2层采掘场"] = {}
地图信息["北部地下2层采掘场"]["北部天桥3"] = {x = 9, y = 152, npc = ""}
地图信息["北部地下2层采掘场"]["北部天桥2"] = {x = 129, y = 42, npc = ""}

地图信息["北部天桥2"] = {}
地图信息["北部天桥2"]["北部地下2层采掘场"] = {x = 53, y = 52, npc = ""}
地图信息["北部天桥2"]["北部地下1层采掘场"] = {x = 54, y = 23, npc = ""}

地图信息["北部地下1层采掘场"] = {}
地图信息["北部地下1层采掘场"]["北部天桥2"] = {x = 121, y = 191, npc = ""}
地图信息["北部地下1层采掘场"]["北部地下1层第三间屋"] = {x = 10, y = 106, npc = ""}

地图信息["北部地下1层第三间屋"] = {}
地图信息["北部地下1层第三间屋"]["北部地下1层采掘场"] = {x = 71, y = 19, npc = ""}
地图信息["北部地下1层第三间屋"]["北部矿山东部洞穴"] = {x = 14, y = 79, npc = ""}

地图信息["北部矿山东部洞穴"] = {}
地图信息["北部矿山东部洞穴"]["北部地下1层第三间屋"] = {x = 195, y = 81, npc = ""}
地图信息["北部矿山东部洞穴"]["北部地下1层第二间屋"] = {x = 8, y = 147, npc = ""}

地图信息["北部地下1层第二间屋"] = {}
地图信息["北部地下1层第二间屋"]["北部矿山东部洞穴"] = {x = 86, y = 9, npc = ""}
地图信息["北部地下1层第二间屋"]["北部矿山入口"] = {x = 10, y = 7, npc = ""}
--蛇谷北部矿山

地图信息["南部矿山1层"] = {}
地图信息["南部矿山1层"]["南部矿山2层"] = {x = 361, y = 19, npc = ""}
地图信息["南部矿山1层"]["蛇谷"] = {x = 30, y = 375, npc = "交通疏散员_老矿工", text = "确定"}

地图信息["南部矿山2层"] = {}
地图信息["南部矿山2层"]["南部矿山1层"] = {x = 22, y = 42, npc = ""}

地图信息["比奇县"] = {}
地图信息["比奇县"]["半兽洞穴1层"] = {x = 65, y = 174, npc = "交通疏散员_探路者", text = "确定"}
地图信息["比奇县"]["边境村落"] = {x = 335, y = 775, npc = ""}
地图信息["比奇县"]["道馆"] = {x = 209, y = 49, npc = ""}
地图信息["比奇县"]["废矿山入口"] = {x = 764, y = 206, npc = "交通疏散员_探路者", text = "确定"}
地图信息["比奇县"]["银杏村落"] = {x = 778, y = 700, npc = ""}
地图信息["比奇县"]["蛇谷"] = {x = 645, y = 17, npc = ""}
地图信息["比奇县"]["比奇内城"] = {x = 478, y = 357, npc = ""}

地图信息["比奇内城"] = {}
地图信息["比奇内城"]["比奇县"] = {x = 20, y = 53, npc = ""}

地图信息["半兽洞穴1层"] = {}
地图信息["半兽洞穴1层"]["比奇县"] = {x = 149, y = 364, npc = ""}
地图信息["半兽洞穴1层"]["半兽勇士洞"] = {x = 303, y = 65, npc = ""}
地图信息["半兽洞穴1层"]["半兽洞穴2层"] = {x = 30, y = 328, npc = ""}

地图信息["半兽洞穴2层"] = {}
地图信息["半兽洞穴2层"]["半兽洞穴1层"] = {x = 34, y = 322, npc = ""}
地图信息["半兽洞穴2层"]["半兽洞穴3层"] = {x = 117, y = 95, npc = ""}
地图信息["半兽洞穴2层"]["半兽精灵洞"] = {x = 255, y = 281, npc = ""}

地图信息["半兽精灵洞"] = {}
地图信息["半兽精灵洞"]["半兽洞穴2层"] = {x = 7, y = 9, npc = ""}

地图信息["半兽洞穴3层"] = {}
地图信息["半兽洞穴3层"]["半兽洞穴2层"] = {x = 106, y = 82, npc = ""}
地图信息["半兽洞穴3层"]["半兽自然洞穴"] = {x = 78, y = 229, npc = ""}
--地图信息["半兽洞穴3层"]["连接通道^半兽洞穴3层"] = {x = 290, y = 293, npc = ""}

地图信息["半兽勇士洞"] = {}
地图信息["半兽勇士洞"]["半兽洞穴1层"] = {x = 7, y = 9, npc = ""}

地图信息["半兽自然洞穴"] = {}
地图信息["半兽自然洞穴"]["半兽洞穴3层"] = {x = 8, y = 13, npc = ""}

--地图信息["连接通道^半兽洞穴3层"] = {}
--地图信息["连接通道^半兽洞穴3层"]["半兽洞穴3层"] = {x = 15, y = 9, npc = ""}

--
地图信息["废矿山入口"] = {}
地图信息["废矿山入口"]["比奇县"] = {x = 24, y = 182, npc = "交通疏散员_探路者", text = "确定"}
地图信息["废矿山入口"]["地下1层第一间屋"] = {x = 76, y = 15, npc = ""}
地图信息["废矿山入口"]["地下1层第二间屋"] = {x = 179, y = 109, npc = ""}

地图信息["地下1层第一间屋"] = {}
地图信息["地下1层第一间屋"]["废矿南部洞穴"] = {x = 95, y = 49, npc = ""}
地图信息["地下1层第一间屋"]["废矿山入口"] = {x = 60, y = 7, npc = ""}

地图信息["废矿南部洞穴"] = {}
地图信息["废矿南部洞穴"]["地下1层第一间屋"] = {x = 23, y = 15, npc = ""}
地图信息["废矿南部洞穴"]["天桥1"] = {x = 186, y = 119, npc = ""}

地图信息["天桥1"] = {}
地图信息["天桥1"]["废矿南部洞穴"] = {x = 8, y = 86, npc = ""}
地图信息["天桥1"]["矿石储藏处"] = {x = 84, y = 16, npc = ""}

地图信息["矿石储藏处"] = {}
地图信息["矿石储藏处"]["天桥1"] = {x = 11, y = 148, npc = ""}
地图信息["矿石储藏处"]["天桥3"] = {x = 166, y = 138, npc = ""}

地图信息["天桥3"] = {}
地图信息["天桥3"]["地下2层采掘场"] = {x = 90, y = 16, npc = ""}
地图信息["天桥3"]["矿石储藏处"] = {x = 6, y = 54, npc = ""}

地图信息["地下2层采掘场"] = {}
地图信息["地下2层采掘场"]["天桥3"] = {x = 9, y = 152, npc = ""}
地图信息["地下2层采掘场"]["废矿山地下2层"] = {x = 55, y = 127, npc = ""}
地图信息["地下2层采掘场"]["天桥2"] = {x = 129, y = 42, npc = ""}
--地图信息["地下2层采掘场"]["连接通道^地下2层采掘场"] = {x = 152, y = 19, npc = ""}

地图信息["天桥2"] = {}
地图信息["天桥2"]["地下2层采掘场"] = {x = 53, y = 52, npc = ""}
地图信息["天桥2"]["地下1层采掘场"] = {x = 54, y = 23, npc = ""}

地图信息["地下1层采掘场"] = {}
地图信息["地下1层采掘场"]["天桥2"] = {x = 121, y = 191, npc = ""}
地图信息["地下1层采掘场"]["地下1层第三间屋"] = {x = 10, y = 106, npc = ""}

地图信息["地下1层第三间屋"] = {}
地图信息["地下1层第三间屋"]["地下1层采掘场"] = {x = 71, y = 19, npc = ""}
地图信息["地下1层第三间屋"]["废矿东部洞穴"] = {x = 14, y = 79, npc = ""}

地图信息["废矿东部洞穴"] = {}
地图信息["废矿东部洞穴"]["地下1层第三间屋"] = {x = 195, y = 81, npc = ""}
地图信息["废矿东部洞穴"]["地下1层第二间屋"] = {x = 8, y = 147, npc = ""}

地图信息["地下1层第二间屋"] = {}
地图信息["地下1层第二间屋"]["废矿东部洞穴"] = {x = 86, y = 9, npc = ""}
地图信息["地下1层第二间屋"]["废矿山入口"] = {x = 10, y = 7, npc = ""}

地图信息["废矿山地下2层"] = {}
地图信息["废矿山地下2层"]["地下2层采掘场"] = {x = 3, y = 12, npc = ""}

--地图信息["连接通道^地下2层采掘场"] = {}
--地图信息["连接通道^地下2层采掘场"]["地下2层采掘场"] = {x = 69, y = 56, npc = ""}

地图信息["道馆"] = {}
地图信息["道馆"]["沃玛神殿入口"] = {x = 54, y = 370, npc = ""}
地图信息["道馆"]["比奇县"] = {x = 515, y = 581, npc = ""}
地图信息["道馆"]["失乐园"] = {x = 21, y = 567, npc = ""}
地图信息["道馆"]["道馆废矿"] = {x = 194, y = 181, npc = ""}
地图信息["道馆"]["灌木林"] = {x = 404, y = 30, npc = ""}

地图信息["道馆废矿"] = {}
地图信息["道馆废矿"]["道馆"] = {x = 11, y = 148, npc = ""}

地图信息["沃玛神殿入口"] = {}
地图信息["沃玛神殿入口"]["道馆"] = {x = 77, y = 75, npc = ""}
地图信息["沃玛神殿入口"]["沃玛神殿东馆1层"] = {x = 47, y = 37, npc = ""}--！
地图信息["沃玛神殿入口"]["沃玛神殿西馆1层"] = {x = 34, y = 50, npc = ""}--！
地图信息["沃玛神殿入口"]["沃玛神殿1层"] = {x = 26, y = 27, npc = ""}--！

地图信息["沃玛神殿1层"] = {}
地图信息["沃玛神殿1层"]["沃玛神殿入口"] = {x = 338, y = 354, npc = ""}--！
地图信息["沃玛神殿1层"]["沃玛神殿2层"] = {x = 251, y = 207, npc = ""}--！

地图信息["沃玛神殿东馆1层"] = {}
地图信息["沃玛神殿东馆1层"]["沃玛神殿入口"] = {x = 338, y = 354, npc = ""}--！
地图信息["沃玛神殿东馆1层"]["沃玛神殿东馆2层"] = {x = 251, y = 207, npc = ""}--！

地图信息["沃玛神殿西馆1层"] = {}
地图信息["沃玛神殿西馆1层"]["沃玛神殿入口"] = {x = 338, y = 354, npc = ""}--！
地图信息["沃玛神殿西馆1层"]["沃玛神殿西馆2层"] = {x = 251, y = 207, npc = ""}--！

地图信息["沃玛神殿2层"] = {}
地图信息["沃玛神殿2层"]["沃玛神殿1层"] = {x = 198, y = 193, npc = ""}--！
地图信息["沃玛神殿2层"]["沃玛神殿"] = {x = 52, y = 366, npc = ""}--！

地图信息["沃玛神殿东馆2层"] = {}
地图信息["沃玛神殿东馆2层"]["沃玛神殿"] = {x = 52, y = 366, npc = ""}--！
地图信息["沃玛神殿东馆2层"]["沃玛神殿东馆1层"] = {x = 198, y = 193, npc = ""}--！

地图信息["沃玛神殿西馆2层"] = {}
地图信息["沃玛神殿西馆2层"]["沃玛神殿西馆1层"] = {x = 198, y = 193, npc = ""}--！
地图信息["沃玛神殿西馆2层"]["沃玛神殿"] = {x = 52, y = 366, npc = ""}--！

地图信息["沃玛神殿"] = {}
地图信息["沃玛神殿"]["沃玛神殿东馆2层"] = {x = 46, y = 28, npc = ""}--！
地图信息["沃玛神殿"]["沃玛神殿西馆2层"] = {x = 28, y = 46, npc = ""}--！
地图信息["沃玛神殿"]["沃玛神殿2层"] = {x = 16, y = 18, npc = ""}--！

地图信息["银杏村落"] = {}
地图信息["银杏村落"]["银杏废矿"] = {x = 129, y = 157, npc = ""}
地图信息["银杏村落"]["自然洞穴1层"] = {x = 483, y = 322, npc = ""}
地图信息["银杏村落"]["比奇县"] = {x = 28, y = 454, npc = ""}

地图信息["银杏废矿"] = {}
地图信息["银杏废矿"]["银杏村落"] = {x = 11, y = 148, npc = ""}

地图信息["自然洞穴1层"] = {}
地图信息["自然洞穴1层"]["银杏村落"] = {x = 155, y = 368, npc = ""}
地图信息["自然洞穴1层"]["自然洞穴2层"] = {x = 126, y = 201, npc = ""}

地图信息["自然洞穴2层"] = {}
地图信息["自然洞穴2层"]["自然洞穴1层"] = {x = 78, y = 197, npc = ""}

地图信息["边境村落"] = {}
地图信息["边境村落"]["比奇县"] = {x = 565, y = 66, npc = ""}--！
地图信息["边境村落"]["边境废矿"] = {x = 294, y = 153, npc = ""}--！
地图信息["边境村落"]["盟重县"] = {x = 87, y = 406, npc = ""}--！

地图信息["边境废矿"] = {}
地图信息["边境废矿"]["边境村落"] = {x = 11, y = 148, npc = ""}--！

地图信息["废矿秘密通道"] = {}
地图信息["废矿秘密通道"]["绝命1层南部"] = {x = 13, y = 63, npc = ""}

地图信息["绝命1层北部"] = {}
地图信息["绝命1层北部"]["奇岩石室"] = {x = 81, y = 81, npc = ""}
地图信息["绝命1层北部"]["紫水晶屋"] = {x = 41, y = 194, npc = ""}
地图信息["绝命1层北部"]["奇岩通道"] = {x = 185, y = 82, npc = ""}

地图信息["绝命1层南部"] = {}
地图信息["绝命1层南部"]["废矿秘密通道"] = {x = 9, y = 197, npc = ""}
地图信息["绝命1层南部"]["奇岩石室"] = {x = 149, y = 55, npc = ""}
地图信息["绝命1层南部"]["石灯室"] = {x = 52, y = 14, npc = ""}
地图信息["绝命1层南部"]["盟重县"] = {x = 208, y = 238, npc = ""}

地图信息["奇岩石室"] = {}
地图信息["奇岩石室"]["绝命1层南部"] = {x = 30, y = 30, npc = ""}
地图信息["奇岩石室"]["绝命1层北部"] = {x = 30, y = 15, npc = ""}

地图信息["紫水晶屋"] = {}
地图信息["紫水晶屋"]["绝命1层北部"] = {x = 18, y = 22, npc = ""}
地图信息["紫水晶屋"]["绝命2层北部"] = {x = 32, y = 32, npc = ""}
地图信息["紫水晶屋"]["绝命2层西部"] = {x = 17, y = 33, npc = ""}

地图信息["绝命1层西部"] = {}
地图信息["绝命1层西部"]["奇岩通道"] = {x = 177, y = 33, npc = ""}
地图信息["绝命1层西部"]["石灯室"] = {x = 110, y = 86, npc = ""}
地图信息["绝命1层西部"]["绝命2层北部"] = {x = 45, y = 22, npc = ""}

地图信息["绝命2层北部"] = {}
地图信息["绝命2层北部"]["绝命1层西部"] = {x = 173, y = 60, npc = ""}
地图信息["绝命2层北部"]["紫水晶屋"] = {x = 42, y = 19, npc = ""}
地图信息["绝命2层北部"]["石阁川"] = {x = 42, y = 124, npc = ""}

地图信息["绝命2层西部"] = {}
地图信息["绝命2层西部"]["紫水晶屋"] = {x = 149, y = 132, npc = ""}
地图信息["绝命2层西部"]["奇岩通道"] = {x = 155, y = 36, npc = ""}

地图信息["绝命3层"] = {}
地图信息["绝命3层"]["奇岩通道"] = {x = 39, y = 24, npc = ""}

地图信息["石灯室"] = {}
地图信息["石灯室"]["绝命1层西部"] = {x = 31, y = 8, npc = ""}
地图信息["石灯室"]["绝命1层南部"] = {x = 16, y = 29, npc = ""}

地图信息["奇岩通道"] = {}
地图信息["奇岩通道"]["绝命1层西部"] = {x = 32, y = 40, npc = ""}
地图信息["奇岩通道"]["绝命1层北部"] = {x = 55, y = 37, npc = ""}

地图信息["奇岩通道"]["绝命2层西部"] = {x = 32, y = 71, npc = ""}
地图信息["奇岩通道"]["绝命3层"] = {x = 58, y = 70, npc = ""}

地图信息["盟重县"] = {}
地图信息["盟重县"]["边境村落"] = {x = 583, y = 292, npc = ""}
地图信息["盟重县"]["绝命1层南部"] = {x = 334, y = 72, npc = ""}
地图信息["盟重县"]["石阁庙"] = {x = 21, y = 311, npc = ""}
地图信息["盟重县"]["万年谷"] = {x = 78, y = 227, npc = ""}
地图信息["盟重县"]["铗虫谷1层"] = {x = 132, y = 503, npc = ""}

地图信息["铗虫谷1层"] = {}
地图信息["铗虫谷1层"]["盟重县"] = {x = 41, y = 168, npc = ""}
地图信息["铗虫谷1层"]["铗虫谷2层"] = {x = 170, y = 23, npc = ""}

地图信息["铗虫谷2层"] = {}
地图信息["铗虫谷2层"]["铗虫谷1层"] = {x = 39, y = 174, npc = ""}
地图信息["铗虫谷2层"]["铗虫谷3层"] = {x = 148, y = 31, npc = ""}

地图信息["铗虫谷3层"] = {}
地图信息["铗虫谷3层"]["铗虫谷2层"] = {x = 81, y = 167, npc = ""}
地图信息["铗虫谷3层"]["铗虫谷4层"] = {x = 161, y = 33, npc = ""}

地图信息["铗虫谷4层"] = {}
地图信息["铗虫谷4层"]["铗虫谷3层"] = {x = 14, y = 192, npc = ""}
地图信息["铗虫谷4层"]["铗虫谷5层"] = {x = 247, y = 105, npc = ""}

地图信息["铗虫谷5层"] = {}
地图信息["铗虫谷5层"]["铗虫谷4层"] = {x = 219, y = 267, npc = ""}

地图信息["万年谷"] = {}
地图信息["万年谷"]["盟重县"] = {x = 160, y = 169, npc = ""}
地图信息["万年谷"]["万年本谷"] = {x = 29, y = 32, npc = ""}

地图信息["石阁川"] = {}
地图信息["石阁川"]["万年本谷"] = {x = 22, y = 13, npc = ""}
地图信息["石阁川"]["绝命2层北部"] = {x = 14, y = 34, npc = ""}

地图信息["万年本谷"] = {}
地图信息["万年本谷"]["万年谷"] = {x = 11, y = 15, npc = ""}
地图信息["万年本谷"]["万年谷北部"] = {x = 283, y = 232, npc = ""}
地图信息["万年本谷"]["万年谷南部"] = {x = 9, y = 182, npc = ""}
地图信息["万年本谷"]["万年中谷"] = {x = 202, y = 187, npc = ""}
地图信息["万年本谷"]["石阁川"] = {x = 199, y = 51, npc = ""}

地图信息["万年孤独馆"] = {}
地图信息["万年孤独馆"]["万年谷东部"] = {x = 53, y = 21, npc = ""}
地图信息["万年孤独馆"]["万年谷西部"] = {x = 13, y = 83, npc = ""}
地图信息["万年孤独馆"]["万年中谷"] = {x = 149, y = 65, npc = ""}
地图信息["万年孤独馆"]["生死关"] = {x = 160, y = 170, npc = ""}

地图信息["生死关"] = {}
地图信息["生死关"]["万年孤独馆"] = {x = 9, y = 25, npc = ""}

地图信息["万年谷北部"] = {}
地图信息["万年谷北部"]["万年本谷"] = {x = 26, y = 16, npc = ""}
地图信息["万年谷北部"]["万年谷东部"] = {x = 86, y = 17, npc = ""}

地图信息["万年谷东部"] = {}
地图信息["万年谷东部"]["万年孤独馆"] = {x = 90, y = 11, npc = ""}
地图信息["万年谷东部"]["万年谷北部"] = {x = 43, y = 42, npc = ""}

地图信息["万年谷南部"] = {}
地图信息["万年谷南部"]["万年本谷"] = {x = 69, y = 65, npc = ""}
地图信息["万年谷南部"]["万年谷西部"] = {x = 13, y = 19, npc = ""}

地图信息["万年谷西部"] = {}
地图信息["万年谷西部"]["万年孤独馆"] = {x = 88, y = 75, npc = ""}
地图信息["万年谷西部"]["万年谷南部"] = {x = 64, y = 82, npc = ""}

地图信息["万年中谷"] = {}
地图信息["万年中谷"]["万年本谷"] = {x = 8, y = 50, npc = ""}
地图信息["万年中谷"]["万年孤独馆"] = {x = 12, y = 13, npc = ""}

地图信息["沙漠"] = {}
地图信息["沙漠"]["绿洲"] = {x = 383, y = 71, npc = ""}
地图信息["沙漠"]["南部蚂蚁洞穴1层1"] = {x = 291, y = 719, npc = ""}
地图信息["沙漠"]["石阁庙"] = {x = 767, y = 559, npc = ""}

地图信息["沙漠土城"] = {}
地图信息["沙漠土城"]["绿洲"] = {x = 110, y = 386, npc = ""}

地图信息["南部蚂蚁洞穴1层1"] = {}
地图信息["南部蚂蚁洞穴1层1"]["南部蚂蚁洞穴1层2"] = {x = 6, y = 43, npc = ""}
地图信息["南部蚂蚁洞穴1层1"]["沙漠"] = {x = 178, y = 189, npc = ""}
地图信息["南部蚂蚁洞穴1层1"]["失乐园"] = {x = 40, y = 176, npc = ""}

地图信息["南部蚂蚁洞穴1层2"] = {}
地图信息["南部蚂蚁洞穴1层2"]["南部蚂蚁洞穴1层1"] = {x = 186, y = 58, npc = ""}
地图信息["南部蚂蚁洞穴1层2"]["南部蚂蚁洞穴1层3"] = {x = 29, y = 185, npc = ""}

地图信息["南部蚂蚁洞穴1层3"] = {}
地图信息["南部蚂蚁洞穴1层3"]["南部蚂蚁洞穴1层2"] = {x = 34, y = 20, npc = ""}
地图信息["南部蚂蚁洞穴1层3"]["南部蚂蚁洞穴1层4"] = {x = 129, y = 178, npc = ""}

地图信息["南部蚂蚁洞穴1层4"] = {}
地图信息["南部蚂蚁洞穴1层4"]["南部蚂蚁洞穴1层3"] = {x = 7, y = 184, npc = ""}
地图信息["南部蚂蚁洞穴1层4"]["南部毛虫室"] = {x = 159, y = 155, npc = ""}


地图信息["南部毛虫室"] = {}
地图信息["南部毛虫室"]["南部蚂蚁洞穴1层4"] = {x = 4, y = 17, npc = ""}
地图信息["南部毛虫室"]["南部垃圾场"] = {x = 92, y = 83, npc = ""}

地图信息["南部垃圾场"] = {}
地图信息["南部垃圾场"]["南部毛虫室"] = {x = 3, y = 16, npc = ""}
地图信息["南部垃圾场"]["南部蚂蚁洞穴"] = {x = 7, y = 89, npc = ""}
地图信息["南部垃圾场"]["南部粮仓"] = {x = 89, y = 86, npc = ""}

地图信息["南部蚂蚁洞穴"] = {}
地图信息["南部蚂蚁洞穴"]["南部垃圾场"] = {x = 32, y = 13, npc = ""}

地图信息["南部粮仓"] = {}
地图信息["南部粮仓"]["南部垃圾场"] = {x = 3, y = 14, npc = ""}
地图信息["南部粮仓"]["南部霉菌屋"] = {x = 25, y = 92, npc = ""}

地图信息["南部霉菌屋"] = {}
地图信息["南部霉菌屋"]["南部粮仓"] = {x = 86, y = 7, npc = ""}
地图信息["南部霉菌屋"]["南部蚂蚁洞穴3层1"] = {x = 94, y = 74, npc = ""}

地图信息["南部蚂蚁洞穴3层1"] = {}
地图信息["南部蚂蚁洞穴3层1"]["南部霉菌屋"] = {x = 4, y = 13, npc = ""}
地图信息["南部蚂蚁洞穴3层1"]["南部蚂蚁迷宫3层2"] = {x = 90, y = 69, npc = ""}

地图信息["南部蚂蚁迷宫3层2"] = {}
地图信息["南部蚂蚁迷宫3层2"]["南部蚂蚁洞穴3层1"] = {x = 3, y = 48, npc = ""}
地图信息["南部蚂蚁迷宫3层2"]["南部蚂蚁洞穴3层3"] = {x = 84, y = 14, npc = ""}

地图信息["南部蚂蚁洞穴3层3"] = {}
地图信息["南部蚂蚁洞穴3层3"]["南部蚂蚁迷宫3层2"] = {x = 30, y = 89, npc = ""}		--西
地图信息["南部蚂蚁洞穴3层3"]["南部蚂蚁洞穴3层4"] = {x = 89, y = 10, npc = ""}		--东  暂时过不去3层3

地图信息["南部蚂蚁洞穴3层4"] = {}
地图信息["南部蚂蚁洞穴3层4"]["南部蚂蚁洞穴3层3"] = {x = 8, y = 85, npc = ""}		--暂时过不到

地图信息["石阁1层"] = {}
地图信息["石阁1层"]["石阁2层"] = {x = 364, y = 229, npc = ""}
地图信息["石阁1层"]["石阁入口"] = {x = 205, y = 197, npc = ""}

地图信息["石阁2层"] = {}
地图信息["石阁2层"]["石阁1层"] = {x = 363, y = 227, npc = ""}
地图信息["石阁2层"]["石阁3层"] = {x = 31, y = 193, npc = ""}

地图信息["石阁3层"] = {}
地图信息["石阁3层"]["石阁2层"] = {x = 30, y = 192, npc = ""}
地图信息["石阁3层"]["石阁4层"] = {x = 350, y = 244, npc = ""}

地图信息["石阁4层"] = {}
地图信息["石阁4层"]["石阁3层"] = {x = 381, y = 191, npc = ""}
地图信息["石阁4层"]["石阁5层"] = {x = 16, y = 200, npc = ""}

地图信息["石阁5层"] = {}
地图信息["石阁5层"]["石阁4层"] = {x = 28, y = 345, npc = ""}

地图信息["石阁庙"] = {}
地图信息["石阁庙"]["盟重县"] = {x = 380, y = 219, npc = ""}
地图信息["石阁庙"]["沙漠"] = {x = 23, y = 209, npc = ""}
地图信息["石阁庙"]["石阁入口"] = {x = 202, y = 61, npc = ""}

地图信息["石阁入口"] = {}
地图信息["石阁入口"]["石阁1层"] = {x = 25, y = 21, npc = ""}
地图信息["石阁入口"]["石阁庙"] = {x = 26, y = 23, npc = ""}

地图信息["绿洲"] = {}
地图信息["绿洲"]["北部蚂蚁洞穴1层1"] = {x = 375, y = 119, npc = ""}
地图信息["绿洲"]["东部蚂蚁洞穴1层1"] = {x = 476, y = 152, npc = ""}
地图信息["绿洲"]["沙漠"] = {x = 281, y = 780, npc = ""}
地图信息["绿洲"]["沙漠土城"] = {x = 516, y = 639, npc = ""}
地图信息["绿洲"]["诺玛村落"] = {x = 29, y = 233, npc = ""}
地图信息["绿洲"]["西部沙漠"] = {x = 73, y = 461, npc = ""}

地图信息["北部蚂蚁洞穴1层1"] = {}
地图信息["北部蚂蚁洞穴1层1"]["北部蚂蚁洞穴1层2"] = {x = 6, y = 43, npc = ""}
地图信息["北部蚂蚁洞穴1层1"]["绿洲"] = {x = 178, y = 189, npc = ""}

地图信息["北部蚂蚁洞穴1层2"] = {}
地图信息["北部蚂蚁洞穴1层2"]["北部蚂蚁洞穴1层1"] = {x = 186, y = 58, npc = ""}
地图信息["北部蚂蚁洞穴1层2"]["北部蚂蚁洞穴1层3"] = {x = 29, y = 185, npc = ""}

地图信息["北部蚂蚁洞穴1层3"] = {}
地图信息["北部蚂蚁洞穴1层3"]["北部蚂蚁洞穴1层2"] = {x = 34, y = 20, npc = ""}
地图信息["北部蚂蚁洞穴1层3"]["北部蚂蚁洞穴1层4"] = {x = 196, y = 142, npc = ""}

地图信息["北部蚂蚁洞穴1层4"] = {}
地图信息["北部蚂蚁洞穴1层4"]["北部蚂蚁洞穴1层3"] = {x = 12, y = 125, npc = ""}
地图信息["北部蚂蚁洞穴1层4"]["北部毛虫室"] = {x = 159, y = 155, npc = ""}

地图信息["北部毛虫室"] = {}
地图信息["北部毛虫室"]["北部蚂蚁洞穴1层4"] = {x = 4, y = 17, npc = ""}
地图信息["北部毛虫室"]["北部垃圾场"] = {x = 92, y = 83, npc = ""}

地图信息["北部垃圾场"] = {}
地图信息["北部垃圾场"]["北部毛虫室"] = {x = 3, y = 16, npc = ""}
地图信息["北部垃圾场"]["北部蚂蚁洞穴"] = {x = 7, y = 89, npc = ""}
地图信息["北部垃圾场"]["北部粮仓"] = {x = 89, y = 86, npc = ""}

地图信息["北部蚂蚁洞穴"] = {}
地图信息["北部蚂蚁洞穴"]["北部垃圾场"] = {x = 32, y = 13, npc = ""}

地图信息["北部粮仓"] = {}
地图信息["北部粮仓"]["北部垃圾场"] = {x = 3, y = 14, npc = ""}
地图信息["北部粮仓"]["北部霉菌屋"] = {x = 25, y = 92, npc = ""}

地图信息["北部霉菌屋"] = {}
地图信息["北部霉菌屋"]["北部粮仓"] = {x = 86, y = 7, npc = ""}
地图信息["北部霉菌屋"]["北部蚂蚁洞穴3层1"] = {x = 94, y = 74, npc = ""}

地图信息["北部蚂蚁洞穴3层1"] = {}
地图信息["北部蚂蚁洞穴3层1"]["北部霉菌屋"] = {x = 4, y = 13, npc = ""}
地图信息["北部蚂蚁洞穴3层1"]["北部蚂蚁洞穴3层2"] = {x = 90, y = 69, npc = ""}

地图信息["北部蚂蚁洞穴3层2"] = {}
地图信息["北部蚂蚁洞穴3层2"]["北部蚂蚁洞穴3层1"] = {x = 3, y = 48, npc = ""}
地图信息["北部蚂蚁洞穴3层2"]["北部蚂蚁洞穴3层3"] = {x = 84, y = 14, npc = ""}

地图信息["北部蚂蚁洞穴3层3"] = {}
地图信息["北部蚂蚁洞穴3层3"]["北部蚂蚁洞穴3层2"] = {x = 30, y = 89, npc = ""}		--西
地图信息["北部蚂蚁洞穴3层3"]["北部蚂蚁洞穴3层4"] = {x = 89, y = 10, npc = ""}		--东  暂时过不去3层3

地图信息["北部蚂蚁洞穴3层4"] = {}
地图信息["北部蚂蚁洞穴3层4"]["北部蚂蚁洞穴3层3"] = {x = 8, y = 85, npc = ""}		--暂时过不到

地图信息["东部蚂蚁洞穴1层1"] = {}
地图信息["东部蚂蚁洞穴1层1"]["东部蚂蚁洞穴1层2"] = {x = 6, y = 43, npc = ""}
地图信息["东部蚂蚁洞穴1层1"]["绿洲"] = {x = 178, y = 189, npc = ""}

地图信息["东部蚂蚁洞穴1层2"] = {}
地图信息["东部蚂蚁洞穴1层2"]["东部蚂蚁洞穴1层1"] = {x = 186, y = 58, npc = ""}
地图信息["东部蚂蚁洞穴1层2"]["东部蚂蚁洞穴1层3"] = {x = 29, y = 185, npc = ""}

地图信息["东部蚂蚁洞穴1层3"] = {}
地图信息["东部蚂蚁洞穴1层3"]["东部蚂蚁洞穴1层2"] = {x = 34, y = 20, npc = ""}
地图信息["东部蚂蚁洞穴1层3"]["东部蚂蚁洞穴1层4"] = {x = 196, y = 142, npc = ""}

地图信息["东部蚂蚁洞穴1层4"] = {}
地图信息["东部蚂蚁洞穴1层4"]["东部蚂蚁洞穴1层3"] = {x = 12, y = 125, npc = ""}
地图信息["东部蚂蚁洞穴1层4"]["东部毛虫室"] = {x = 159, y = 155, npc = ""}

地图信息["东部毛虫室"] = {}
地图信息["东部毛虫室"]["东部蚂蚁洞穴1层4"] = {x = 4, y = 17, npc = ""}
地图信息["东部毛虫室"]["东部垃圾场"] = {x = 92, y = 83, npc = ""}

地图信息["东部垃圾场"] = {}
地图信息["东部垃圾场"]["东部毛虫室"] = {x = 3, y = 16, npc = ""}
地图信息["东部垃圾场"]["东部蚂蚁洞穴"] = {x = 7, y = 89, npc = ""}
地图信息["东部垃圾场"]["东部粮仓"] = {x = 89, y = 86, npc = ""}

地图信息["东部蚂蚁洞穴"] = {}
地图信息["东部蚂蚁洞穴"]["东部垃圾场"] = {x = 32, y = 13, npc = ""}

地图信息["东部粮仓"] = {}
地图信息["东部粮仓"]["东部垃圾场"] = {x = 3, y = 14, npc = ""}
地图信息["东部粮仓"]["东部霉菌屋"] = {x = 25, y = 92, npc = ""}

地图信息["东部霉菌屋"] = {}
地图信息["东部霉菌屋"]["东部粮仓"] = {x = 86, y = 7, npc = ""}
地图信息["东部霉菌屋"]["东部蚂蚁洞穴3层1"] = {x = 94, y = 74, npc = ""}

地图信息["东部蚂蚁洞穴3层1"] = {}
地图信息["东部蚂蚁洞穴3层1"]["东部霉菌屋"] = {x = 4, y = 13, npc = ""}
地图信息["东部蚂蚁洞穴3层1"]["东部蚂蚁洞穴3层2"] = {x = 90, y = 69, npc = ""}

地图信息["东部蚂蚁洞穴3层2"] = {}
地图信息["东部蚂蚁洞穴3层2"]["东部蚂蚁洞穴3层1"] = {x = 3, y = 48, npc = ""}
地图信息["东部蚂蚁洞穴3层2"]["东部蚂蚁洞穴3层3"] = {x = 84, y = 14, npc = ""}

地图信息["东部蚂蚁洞穴3层3"] = {}
地图信息["东部蚂蚁洞穴3层3"]["东部蚂蚁洞穴3层2"] = {x = 30, y = 89, npc = ""}		--西
地图信息["东部蚂蚁洞穴3层3"]["东部蚂蚁洞穴3层4"] = {x = 89, y = 10, npc = ""}		--东  暂时过不去3层3

地图信息["东部蚂蚁洞穴3层4"] = {}
地图信息["东部蚂蚁洞穴3层4"]["东部蚂蚁洞穴3层3"] = {x = 8, y = 85, npc = ""}		--暂时过不到

地图信息["诺玛村落"] = {}
地图信息["诺玛村落"]["绿洲"] = {x = 381, y = 345, npc = ""}
地图信息["诺玛村落"]["诺玛东部峡谷"] = {x = 30, y = 140, npc = ""}
地图信息["诺玛村落"]["诺玛遗址1层"] = {x = 184, y = 107, npc = "诺玛遗址传送官", text="我要进入诺玛遗址1层"}
地图信息["诺玛村落"]["诺玛遗址镜像1层"] = {x = 184, y = 107, npc = "诺玛遗址传送官", text="我要进入诺玛遗址镜像1层"}
地图信息["诺玛村落"]["诺玛族的试炼地1层"] = {x = 184, y = 107, npc = "诺玛遗址传送官", text="我要进入诺玛族的试炼地1层"}
地图信息["诺玛村落"]["古诺玛遗址1层"] = {x = 184, y = 107, npc = "诺玛遗址传送官", text="我要进入古诺玛遗址1层(寂幻任务)"}


地图信息["诺玛东部峡谷"] = {}
地图信息["诺玛东部峡谷"]["诺玛村落"] = {x = 373, y = 327, npc = ""}
地图信息["诺玛东部峡谷"]["诺玛南部山谷"] = {x = 34, y = 189, npc = ""}

地图信息["诺玛南部山谷"] = {}
地图信息["诺玛南部山谷"]["诺玛东部峡谷"] = {x = 333, y = 64, npc = ""}
地图信息["诺玛南部山谷"]["西部沙漠"] = {x = 41, y = 204, npc = ""}

地图信息["诺玛遗址1层"] = {}
地图信息["诺玛遗址1层"]["诺玛村落"] = {x = 39, y = 149, npc = ""}
地图信息["诺玛遗址1层"]["诺玛遗址2层"] = {x = 207, y = 202, npc = ""}

地图信息["诺玛遗址2层"] = {}
地图信息["诺玛遗址2层"]["诺玛遗址1层"] = {x = 195, y = 200, npc = ""}
地图信息["诺玛遗址2层"]["诺玛遗址3层-1"] = {x = 383, y = 205, npc = ""}
地图信息["诺玛遗址2层"]["诺玛遗址3层-2"] = {x = 199, y = 14, npc = ""}
地图信息["诺玛遗址2层"]["诺玛遗址3层-3"] = {x = 12, y = 194, npc = ""}
地图信息["诺玛遗址2层"]["诺玛遗址3层-4"] = {x = 188, y = 385, npc = ""}

地图信息["诺玛遗址3层-1"] = {}
地图信息["诺玛遗址3层-1"]["诺玛遗址2层"] = {x = 356, y = 367, npc = ""}
地图信息["诺玛遗址3层-1"]["诺玛遗址4层"] = {x = 200, y = 220, npc = ""}

地图信息["诺玛遗址3层-2"] = {}
地图信息["诺玛遗址3层-2"]["诺玛遗址2层"] = {x = 340, y = 79, npc = ""}
地图信息["诺玛遗址3层-2"]["诺玛遗址4层"] = {x = 200, y = 217, npc = ""}

地图信息["诺玛遗址3层-3"] = {}
地图信息["诺玛遗址3层-3"]["诺玛遗址2层"] = {x = 43, y = 55, npc = ""}
地图信息["诺玛遗址3层-3"]["诺玛遗址4层"] = {x = 198, y = 218, npc = ""}

地图信息["诺玛遗址3层-4"] = {}
地图信息["诺玛遗址3层-4"]["诺玛遗址2层"] = {x = 63, y = 355, npc = ""}
地图信息["诺玛遗址3层-4"]["诺玛遗址4层"] = {x = 199, y = 217, npc = ""}

地图信息["诺玛遗址4层"] = {}
地图信息["诺玛遗址4层"]["诺玛遗址3层-1"] = {x = 192, y = 177, npc = ""}
地图信息["诺玛遗址4层"]["诺玛遗址3层-2"] = {x = 192, y = 185, npc = ""}
地图信息["诺玛遗址4层"]["诺玛遗址3层-3"] = {x = 199, y = 185, npc = ""}
地图信息["诺玛遗址4层"]["诺玛遗址3层-4"] = {x = 199, y = 177, npc = ""}

地图信息["古诺玛遗址1层"] = {}
地图信息["古诺玛遗址1层"]["诺玛村落"] = {x = 39, y = 149, npc = ""}
地图信息["古诺玛遗址1层"]["古诺玛遗址2层"] = {x = 207, y = 202, npc = ""}

地图信息["古诺玛遗址2层"] = {}
地图信息["古诺玛遗址2层"]["古诺玛遗址1层"] = {x = 195, y = 200, npc = ""}
地图信息["古诺玛遗址2层"]["古诺玛遗址3层-1"] = {x = 383, y = 205, npc = ""}
地图信息["古诺玛遗址2层"]["古诺玛遗址3层-2"] = {x = 199, y = 14, npc = ""}
地图信息["古诺玛遗址2层"]["古诺玛遗址3层-3"] = {x = 12, y = 194, npc = ""}
地图信息["古诺玛遗址2层"]["古诺玛遗址3层-4"] = {x = 188, y = 385, npc = ""}

地图信息["古诺玛遗址3层-1"] = {}
地图信息["古诺玛遗址3层-1"]["古诺玛遗址2层"] = {x = 356, y = 367, npc = ""}
地图信息["古诺玛遗址3层-1"]["古诺玛遗址4层"] = {x = 200, y = 220, npc = ""}

地图信息["古诺玛遗址3层-2"] = {}
地图信息["古诺玛遗址3层-2"]["古诺玛遗址2层"] = {x = 340, y = 79, npc = ""}
地图信息["古诺玛遗址3层-2"]["古诺玛遗址4层"] = {x = 200, y = 217, npc = ""}

地图信息["古诺玛遗址3层-3"] = {}
地图信息["古诺玛遗址3层-3"]["古诺玛遗址2层"] = {x = 43, y = 55, npc = ""}
地图信息["古诺玛遗址3层-3"]["古诺玛遗址4层"] = {x = 198, y = 218, npc = ""}

地图信息["古诺玛遗址3层-4"] = {}
地图信息["古诺玛遗址3层-4"]["古诺玛遗址2层"] = {x = 63, y = 355, npc = ""}
地图信息["古诺玛遗址3层-4"]["古诺玛遗址4层"] = {x = 199, y = 217, npc = ""}

地图信息["古诺玛遗址4层"] = {}
地图信息["古诺玛遗址4层"]["古诺玛遗址3层-1"] = {x = 192, y = 177, npc = ""}
地图信息["古诺玛遗址4层"]["古诺玛遗址3层-2"] = {x = 192, y = 185, npc = ""}
地图信息["古诺玛遗址4层"]["古诺玛遗址3层-3"] = {x = 199, y = 185, npc = ""}
地图信息["古诺玛遗址4层"]["古诺玛遗址3层-4"] = {x = 199, y = 177, npc = ""}

地图信息["诺玛族的试炼地1层"] = {}
地图信息["诺玛族的试炼地1层"]["诺玛族的试炼地2层"] = {x = 199, y = 219, npc = ""}

地图信息["诺玛族的试炼地2层"] = {}
地图信息["诺玛族的试炼地2层"]["诺玛族的试炼地1层"] = {x = 340, y = 77, npc = ""}
地图信息["诺玛族的试炼地2层"]["诺玛族的试炼地3层"] = {x = 200, y = 217, npc = ""}

地图信息["诺玛族的试炼地3层"] = {}
地图信息["诺玛族的试炼地3层"]["诺玛族的试炼地2层"] = {x = 43, y = 54, npc = ""}
地图信息["诺玛族的试炼地3层"]["诺玛村落"] = {x = 198, y = 217, npc = ""}

地图信息["诺玛遗址镜像1层"] = {}
地图信息["诺玛遗址镜像1层"]["诺玛村落"] = {x = 91, y = 346, npc = ""}
地图信息["诺玛遗址镜像1层"]["诺玛遗址镜像2层"] = {x = 207, y = 202, npc = ""}

地图信息["诺玛遗址镜像2层"] = {}
地图信息["诺玛遗址镜像2层"]["诺玛遗址镜像1层"] = {x = 195, y = 199, npc = ""}

地图信息["地下城市1层"] = {}
地图信息["地下城市1层"]["地下城市2层"] = {x = 150, y = 190, npc = "交通疏散员_老陆", text = "确定"}
地图信息["地下城市1层"]["西部沙漠地下3层"] = {x = 160, y = 180, npc = "交通疏散员_老陆的女儿", text = "确定"}

地图信息["地下城市2层"] = {}
地图信息["地下城市2层"]["地下城市1层"] = {x = 105, y = 35, npc = "交通疏散员_老柒的女儿", text = "确定"}
地图信息["地下城市2层"]["地下城市3层"] = {x = 100, y = 40, npc = "交通疏散员_老柒", text = "确定"}
地图信息["地下城市2层"]["地下矿山1层"] = {x = 220, y = 135, npc = "交通疏散员_老捌", text = "确定"}

地图信息["地下城市3层"] = {}
地图信息["地下城市3层"]["地下城市2层"] = {x = 120, y = 90, npc = "交通疏散员_老酒的女儿", text = "确定"}
地图信息["地下城市3层"]["地下城市4层"] = {x = 110, y = 100, npc = "交通疏散员_老酒", text = "确定"}

地图信息["地下城市4层"] = {}
地图信息["地下城市4层"]["地下城市3层"] = {x = 125, y = 60, npc = "交通疏散员_老拾的女儿", text = "确定"}

地图信息["地下矿山1层"] = {}
地图信息["地下矿山1层"]["地下城市2层"] = {x = 45, y = 70, npc = "交通疏散员_拾壹的女儿", text = "确定"}
地图信息["地下矿山1层"]["地下矿山2层"] = {x = 30, y = 70, npc = "交通疏散员_拾壹", text = "确定"}

地图信息["地下矿山2层"] = {}
地图信息["地下矿山2层"]["地下矿山1层"] = {x = 25, y = 120, npc = "交通疏散员_拾贰的女儿", text = "确定"}
地图信息["地下矿山2层"]["地下矿山3层"] = {x = 20, y = 125, npc = "交通疏散员_拾贰", text = "确定"}

地图信息["地下矿山3层"] = {}
地图信息["地下矿山3层"]["地下矿山2层"] = {x = 255, y = 35, npc = "交通疏散员_老伍的女儿", text = "确定"}

地图信息["西部沙漠"] = {}
地图信息["西部沙漠"]["绿洲"] = {x = 336, y = 335, npc = ""}
地图信息["西部沙漠"]["诺玛南部山谷"] = {x = 371, y = 117, npc = ""}
地图信息["西部沙漠"]["西部沙漠地下1层"] = {x = 41, y = 181, npc = "交通疏散员_老伍", text = "确定"}

地图信息["西部沙漠地下1层"] = {}
地图信息["西部沙漠地下1层"]["西部沙漠"] = {x = 60, y = 260, npc = "交通疏散员_老大的女儿", text = "确定"}
地图信息["西部沙漠地下1层"]["西部沙漠地下2层"] = {x = 55, y = 250, npc = "交通疏散员_老大", text = "确定"}

地图信息["西部沙漠地下2层"] = {}
地图信息["西部沙漠地下2层"]["西部沙漠地下1层"] = {x = 130, y = 115, npc = "交通疏散员_老叁的女儿", text = "确定"}
地图信息["西部沙漠地下2层"]["西部沙漠地下3层"] = {x = 120, y = 105, npc = "交通疏散员_老叁", text = "确定"}

地图信息["西部沙漠地下3层"] = {}
地图信息["西部沙漠地下3层"]["地下城市1层"] = {x = 50, y = 105, npc = "交通疏散员_老肆", text = "确定"}
地图信息["西部沙漠地下3层"]["西部沙漠地下2层"] = {x = 55, y = 95, npc = "交通疏散员_老肆的女儿", text = "确定"}


地图信息["本国领土"] = {}
地图信息["本国领土"]["雪原村落"] = {x = 37, y = 31, npc = ""}
地图信息["本国领土"]["熔岩地带1"] = {x = 222, y = 95, npc = "赤龙石门"}

地图信息["熔岩地带1"] = {}
地图信息["熔岩地带1"]["本国领土"] = {x = 26, y = 26, npc = "传送门", text = ""}
地图信息["熔岩地带1"]["熔岩地带2"] = {x = 208, y = 259, npc = "传送门", text = ""}

地图信息["熔岩地带2"] = {}
地图信息["熔岩地带2"]["熔岩地带1"] = {x = 26, y = 39, npc = "传送门", text = ""}
地图信息["熔岩地带2"]["赤龙城入口"] = {x = 261, y = 36, npc = "传送门", text = ""}

地图信息["赤龙城入口"] = {}
地图信息["赤龙城入口"]["熔岩地带2"] = {x = 23, y = 113, npc = "传送门", text = ""}
地图信息["赤龙城入口"]["赤龙城1层"] = {x = 51, y = 27, npc = "", text = ""}

地图信息["赤龙城1层"] = {}
地图信息["赤龙城1层"]["赤龙城入口"] = {x = 131, y = 201, npc = "", text = ""}
地图信息["赤龙城1层"]["赤龙城2层"] = {x = 131, y = 128, npc = "", text = ""}

地图信息["赤龙城2层"] = {}
地图信息["赤龙城2层"]["赤龙城1层"] = {x = 124, y = 150, npc = "", text = ""}
地图信息["赤龙城2层"]["赤龙城3-1层"] = {x = 16, y = 282, npc = "", text = ""}

地图信息["赤龙城3-1层"] = {}
地图信息["赤龙城3-1层"]["赤龙城2层"] = {x = 278, y = 28, npc = "", text = ""}
地图信息["赤龙城3-1层"]["赤龙城4层"] = {x = 27, y = 280, npc = "", text = ""}

地图信息["赤龙城4层"] = {}
地图信息["赤龙城4层"]["赤龙城3-1层"] = {x = 159, y = 64, npc = "", text = ""}
地图信息["赤龙城4层"]["赤龙城5-1层"] = {x = 100, y = 280, npc = "", text = ""}

地图信息["赤龙城5-1层"] = {}
地图信息["赤龙城5-1层"]["赤龙城4层"] = {x = 88, y = 215, npc = "", text = ""}
地图信息["赤龙城5-1层"]["赤龙城6层"] = {x = 164, y = 139, npc = "", text = ""}

地图信息["赤龙城5-2层"] = {}
地图信息["赤龙城5-2层"]["赤龙城4层"] = {x = 211, y = 90, npc = "", text = ""}
地图信息["赤龙城5-2层"]["赤龙城6层"] = {x = 132, y = 170, npc = "", text = ""}

地图信息["赤龙城6层"] = {}
地图信息["赤龙城6层"]["赤龙城5-1层"] = {x = 22, y = 278, npc = "", text = ""}
地图信息["赤龙城6层"]["赤龙城5-2层"] = {x = 116, y = 186, npc = "", text = ""}


地图信息["失乐虫谷1层"] = {}
地图信息["失乐虫谷1层"]["失乐园"] = {x = 269, y = 44, npc = "樵夫", text = "回到失乐园"}
地图信息["失乐虫谷1层"]["失乐虫谷2层"] = {x = 37, y = 356, npc = "", text = ""}

地图信息["失乐虫谷2层"] = {}
地图信息["失乐虫谷2层"]["失乐虫谷1层"] = {x = 21, y = 163, npc = "", text = ""}
地图信息["失乐虫谷2层"]["失乐虫谷3层"] = {x = 157, y = 28, npc = "", text = ""}

地图信息["失乐虫谷3层"] = {}
地图信息["失乐虫谷3层"]["失乐虫谷2层"] = {x = 82, y = 39, npc = "", text = ""}

地图信息["雪原村落"] = {}
地图信息["雪原村落"]["火影地牢1层"] = {x = 57, y = 333, npc = "去火影地牢一层", text = ""}
地图信息["雪原村落"]["皇陵冥殿1层"] = {x = 304, y = 193, npc = "神秘守陵人", text = "前往皇陵冥殿"}

地图信息["火影地牢1层"] = {}
地图信息["火影地牢1层"]["雪原村落"] = {x = 21, y = 56, npc = "回雪原村落", text = ""}
地图信息["火影地牢1层"]["火影地牢2层"] = {x = 21, y = 45, npc = "去火影地牢二层", text = ""}

地图信息["火影地牢2层"] = {}
地图信息["火影地牢2层"]["火影地牢1层"] = {x = 40, y = 203, npc = "回火影地牢一层", text = ""}
地图信息["火影地牢2层"]["火影地牢3层"] = {x = 27, y = 197, npc = "去火影地牢三层", text = ""}

地图信息["火影地牢3层"] = {}
地图信息["火影地牢3层"]["火影地牢2层"] = {x = 62, y = 251, npc = "回火影地牢二层", text = ""}
地图信息["火影地牢3层"]["火影地牢4层"] = {x = 47, y = 260, npc = "去火影地牢四层", text = ""}

地图信息["火影地牢4层"] = {}
地图信息["火影地牢4层"]["火影地牢3层"] = {x = 42, y = 23, npc = "回火影地牢三层", text = ""}
地图信息["火影地牢4层"]["火影地牢密室"] = {x = 286, y = 276, npc = "", text = ""}

地图信息["火影地牢密室"] = {}
地图信息["火影地牢密室"]["火影地牢4层"] = {x = 18, y = 47, npc = ""}

地图信息["皇陵冥殿1层"] = {}
地图信息["皇陵冥殿1层"]["雪原村落"] = {x = 246, y = 82, npc = "神秘守陵人", text = "离开皇陵冥殿"}
地图信息["皇陵冥殿1层"]["皇陵冥殿2层"] = {x = 246, y = 82, npc = "神秘守陵人", text = "前往下一层"}

地图信息["皇陵冥殿2层"] = {}
地图信息["皇陵冥殿2层"]["皇陵冥殿1层"] = {x = 40, y = 190, npc = "神秘守陵人", text = "回到前一层"}
地图信息["皇陵冥殿2层"]["皇陵冥殿3层"] = {x = 40, y = 190, npc = "神秘守陵人", text = "前往下一层"}

地图信息["皇陵冥殿3层"] = {}
地图信息["皇陵冥殿3层"]["皇陵冥殿2层"] = {x = 322, y = 248, npc = "神秘守陵人", text = "回到前一层"}


----------------------------------------- 
-- 每日任务数据，包含任务打怪信息
怪物所在地图信息 = {}
怪物所在地图信息["跳跳蜂"] = {map = "万年谷"}
怪物所在地图信息["蝴蝶虫"] = {map = "万年谷"}
怪物所在地图信息["蜈蚣"] = {map = "万年谷"}
怪物所在地图信息["钳虫"] = {map = "万年谷"}
怪物所在地图信息["黑色恶蛆"] = {map = "万年谷"}
怪物所在地图信息["沃玛士兵"] = {map = "沃玛神殿1层"}
怪物所在地图信息["黑野猪"] = {map = "石阁1层"}
怪物所在地图信息["红野猪"] = {map = "石阁1层"}
怪物所在地图信息["蝎蛇"] = {map = "石阁1层"}
怪物所在地图信息["楔蛾"] = {map = "石阁1层"}
怪物所在地图信息["沃玛小卒"] = {map = "沃玛神殿1层"}
怪物所在地图信息["火焰沃玛"] = {map = "沃玛神殿1层"}
怪物所在地图信息["沃玛战士"] = {map = "沃玛神殿1层"}
怪物所在地图信息["沃玛士兵"] = {map = "沃玛神殿1层"}

怪物所在地图信息["红蛇"] = {map = "蛇谷"}
怪物所在地图信息["虎蛇"] = {map = "蛇谷"}
怪物所在地图信息["掷斧骷髅"] = {map = "半兽洞穴1层"}
怪物所在地图信息["骷髅战士"] = {map = "半兽洞穴1层"}
怪物所在地图信息["骷髅战将"] = {map = "半兽洞穴1层"}
怪物所在地图信息["骷髅"] = {map = "半兽洞穴1层"}
怪物所在地图信息["牛鬼"] = {map = "废矿山入口"}
怪物所在地图信息["尸鬼"] = {map = "废矿山入口"}
怪物所在地图信息["食鬼"] = {map = "废矿山入口"}
怪物所在地图信息["法鬼"] = {map = "废矿山入口"}
怪物所在地图信息["老道僵尸"] = {map = "废矿山入口"}
怪物所在地图信息["盔甲蚂蚁"] = {map = "南部蚂蚁洞穴1层1"}
怪物所在地图信息["蚂蚁战士"] = {map = "南部蚂蚁洞穴1层1"}
怪物所在地图信息["蚂蚁道士"] = {map = "南部蚂蚁洞穴1层1"}
怪物所在地图信息["爆毒蚂蚁"] = {map = "南部蚂蚁洞穴1层1"}
怪物所在地图信息["蚂蚁工人"] = {map = "南部蚂蚁洞穴1层1"}
-------------------------
怪物所在地图信息["祖玛弓箭手"] = {map = "祖玛神殿1层"}
怪物所在地图信息["祖玛雕像"] = {map = "祖玛神殿3层"}
怪物所在地图信息["祖玛卫士"] = {map = "祖玛神殿3层"}
怪物所在地图信息["大老鼠"] = {map = "祖玛神殿1层"}
怪物所在地图信息["月魔蜘蛛"] = {map = "灌木林"}
怪物所在地图信息["幻影蜘蛛"] = {map = "灌木林"}
怪物所在地图信息["花色蜘蛛"] = {map = "灌木林"}
怪物所在地图信息["黑角蜘蛛"] = {map = "灌木林"}
怪物所在地图信息["蜘蛛山贼"] = {map = "灌木林"}
怪物所在地图信息["赤毒蜘蛛"] = {map = "灌木林"}
怪物所在地图信息["诺玛士卒"] = {map = "诺玛村落"}
怪物所在地图信息["诺玛法老"] = {map = "沙漠"}
怪物所在地图信息["诺玛将士"] = {map = "沙漠"}
怪物所在地图信息["沙漠鱼魔"] = {map = "诺玛村落"}
怪物所在地图信息["沙漠石人"] = {map = "沙漠"}
怪物所在地图信息["沙漠风魔"] = {map = "诺玛村落"}
怪物所在地图信息["沙漠树魔"] = {map = "沙漠"}
怪物所在地图信息["沙漠蜥蜴"] = {map = "诺玛村落"}
怪物所在地图信息["诺玛小兵"] = {map = "沙漠"}
怪物所在地图信息["诺玛战士"] = {map = "诺玛村落"}
怪物所在地图信息["诺玛"] = {map = "沙漠"}
怪物所在地图信息["沙怪"] = {map = "诺玛村落"}

怪物所在地图信息["血巨人"] = {map = "赤月山谷1层"}
怪物所在地图信息["血金刚"] = {map = "赤月山谷1层"}
怪物所在地图信息["赤血魔"] = {map = "赤月山谷1层"}
怪物所在地图信息["灰血魔"] = {map = "赤月山谷1层"}

怪物所在地图信息["潘夜冰魔"] = {map = "潘夜神殿1层"}
怪物所在地图信息["潘夜风魔"] = {map = "潘夜神殿1层"}
怪物所在地图信息["潘夜云魔"] = {map = "潘夜神殿1层"}
怪物所在地图信息["潘夜火魔"] = {map = "潘夜神殿1层"}
怪物所在地图信息["潘夜战士"] = {map = "潘夜神殿1层"}
怪物所在地图信息["潘夜左护卫"] = {map = "潘夜神殿4层"}
怪物所在地图信息["潘夜右护卫"] = {map = "潘夜神殿4层"}

--[[怪物所在地图信息["猿猴战士"] = {map = "失乐园"}
怪物所在地图信息["猿猴战将"] = {map = "失乐园"}
怪物所在地图信息["巨象兽"]   = {map = "失乐园"}--]]

怪物所在地图信息["浪子人鬼"]   = {map = "潘夜岛"}
怪物所在地图信息["腐蚀人鬼"]   = {map = "潘夜岛"}

怪物所在地图信息["骷髅武士"] = {map = "潘夜石窟1层"}
怪物所在地图信息["骷髅弓箭手"] = {map = "潘夜石窟1层"}
怪物所在地图信息["骷髅士兵"] = {map = "潘夜石窟1层"}
怪物所在地图信息["骷髅武将"] = {map = "潘夜石窟1层"}

怪物所在地图信息["黑雾紫红女神"] = {map = "黑雾神殿1层"}
怪物所在地图信息["黑雾绿荫女神"] = {map = "黑雾神殿1层"}

怪物所在地图信息["黑度紫红女神"] = {map = "黑度宫1层"}
怪物所在地图信息["黑度绿荫女神"] = {map = "黑度宫3层"}

怪物所在地图信息["武力神将"]   = {map = "黑度宫4层"}
怪物所在地图信息["火焰狮子"]   = {map = "真天宫地下1层"}
怪物所在地图信息["石像狮子"]   = {map = "真天宫地下1层"}

怪物所在地图信息["变异的诺玛抛石兵"] = {map = "诺玛遗址镜像1层"}
怪物所在地图信息["变异的诺玛斧兵"] = {map = "诺玛遗址镜像1层"}
怪物所在地图信息["变异的诺玛装甲兵"] = {map = "诺玛遗址镜像1层"}
怪物所在地图信息["变异的诺玛司令"] = {map = "诺玛遗址镜像1层"}
怪物所在地图信息["变异的诺玛骑兵"] = {map = "诺玛遗址镜像1层"}
怪物所在地图信息["变异的诺玛突击队长"] = {map = "诺玛遗址镜像1层"}

怪物所在地图信息["诺玛抛石兵"] = {map = "诺玛遗址1层"}
怪物所在地图信息["诺玛装甲兵"] = {map = "诺玛遗址1层"}
怪物所在地图信息["诺玛司令"] = {map = "诺玛遗址1层"}
怪物所在地图信息["诺玛骑兵"] = {map = "诺玛遗址1层"}
怪物所在地图信息["诺玛斧兵"] = {map = "诺玛遗址1层"}

怪物所在地图信息["地牢绿荫女神"] = {map = "真天宫西馆1层"}
怪物所在地图信息["地牢紫红女神"] = {map = "真天宫地下1层"}

怪物所在地图信息["变异利爪蜥"] = {map = "西部沙漠地下1层"}
怪物所在地图信息["变异毒蜥"] = {map = "西部沙漠地下1层"}
怪物所在地图信息["变异迅猛蜥"] = {map = "西部沙漠地下1层"}
怪物所在地图信息["变异刺骨蜥"] = {map = "西部沙漠地下1层"}
怪物所在地图信息["变异丑蜥"] = {map = "西部沙漠地下1层"}

怪物所在地图信息["冰魄武士"] = {map = "火影地牢1层"}
怪物所在地图信息["冰魄斧兵"] = {map = "火影地牢1层"}
怪物所在地图信息["冰魄守将"] = {map = "火影地牢1层"}
怪物所在地图信息["冰魄武将"] = {map = "火影地牢1层"}
怪物所在地图信息["冰魄弓箭手"] = {map = "火影地牢1层"}

怪物所在地图信息["皇陵魂士"] = {map = "皇陵冥殿1层"}
怪物所在地图信息["皇陵魂兵"] = {map = "皇陵冥殿1层"}
怪物所在地图信息["皇陵魂将"] = {map = "皇陵冥殿1层"}
怪物所在地图信息["皇陵御林军"] = {map = "皇陵冥殿1层"}
怪物所在地图信息["皇陵亲卫军"] = {map = "皇陵冥殿1层"}

物品对应怪物 = {}
物品对应怪物["制作毒药"] = {mon = "红蛇"}
物品对应怪物["制作毒药"] = {mon = "虎蛇"}
物品对应怪物["骸骨"] = {mon = "骷髅战士"}
物品对应怪物["骸骨"] = {mon = "骷髅"}
物品对应怪物["尸毒"] = {mon = "尸鬼"}
物品对应怪物["尸毒"] = {mon = "食鬼"}
物品对应怪物["腐毒"] = {mon = "牛鬼"}
物品对应怪物["腐毒"] = {mon = "法鬼"}
物品对应怪物["僵尸牙"] = {mon = "老道僵尸"}
物品对应怪物["寻找秘籍"] = {mon = "沃玛小卒"}
物品对应怪物["寻找秘籍"] = {mon = "沃玛士兵"}
物品对应怪物["寻找手札"] = {mon = "沃玛战士"}
物品对应怪物["寻找手札"] = {mon = "火焰沃玛"}
物品对应怪物["寻找圣泉"] = {mon = "蚂蚁工人"}
物品对应怪物["绿蚁酒"] = {mon = "爆毒蚂蚁"}
物品对应怪物["夺回香料"] = {mon = "浪子人鬼"}
物品对应怪物["夺回玉石"] = {mon = "腐蚀人鬼"}
物品对应怪物["猪鬃刷"] = {mon = "黑野猪"}
物品对应怪物["烧猪蹄"] = {mon = "红野猪"}
物品对应怪物["蜂尾针"] = {mon = "跳跳蜂"}
物品对应怪物["寻找钳虫须"] = {mon = "钳虫"}
物品对应怪物["寻找蜈蚣腿"] = {mon = "蜈蚣"}
物品对应怪物["傀儡石"] = {mon = "骷髅武士"}
物品对应怪物["法老明珠"] = {mon = "诺玛法老"}
物品对应怪物["将士铠甲"] = {mon = "诺玛将士"}
物品对应怪物["诺玛佩剑"] = {mon = "诺玛士卒"}
物品对应怪物["蜥蜴尾"] = {mon = "沙漠蜥蜴"}
物品对应怪物["鱼魔刺"] = {mon = "沙漠鱼魔"}
物品对应怪物["沙木"] = {mon = "沙漠树魔"}
物品对应怪物["墨魂丝"] = {mon = "黑角蜘蛛"}
物品对应怪物["月灵丝"] = {mon = "月魔蜘蛛"}
物品对应怪物["幻影丝"] = {mon = "幻影蜘蛛"}
物品对应怪物["百花丝"] = {mon = "花色蜘蛛"}
物品对应怪物["赤炼丝"] = {mon = "赤毒蜘蛛"}
物品对应怪物["赤血晶"] = {mon = "赤血魔"}
物品对应怪物["灰血晶"] = {mon = "灰血魔"}
物品对应怪物["金刚骨"] = {mon = "血金刚"}
物品对应怪物["寒冰刃"] = {mon = "潘夜冰魔"}
物品对应怪物["霹雳镖"] = {mon = "潘夜云魔"}
物品对应怪物["烈火剑"] = {mon = "潘夜火魔"}
物品对应怪物["护卫权杖"] = {mon = "潘夜左护卫"}
物品对应怪物["护卫旌旗"] = {mon = "潘夜右护卫"}
物品对应怪物["巨象牙"] = {mon = "巨象兽"}
物品对应怪物["猴儿酒"] = {mon = "猿猴战士"}
物品对应怪物["祖玛神弓"] = {mon = "祖玛弓箭手"}
物品对应怪物["黍米"] = {mon = "大老鼠"}
物品对应怪物["狮子骨"] = {mon = "火焰狮子"}
物品对应怪物["狮子骨"] = {mon = "石像狮子"}
物品对应怪物["绿荫女神之泪"] = {mon = "黑度绿荫女神"}
物品对应怪物["绿荫女神之泪"] = {mon = "地牢绿荫女神"}
物品对应怪物["紫红女神之泪"] = {mon = "黑度紫红女神"}
物品对应怪物["紫红女神之泪"] = {mon = "地牢紫红女神"}
物品对应怪物["神力之钥"] = {mon = "武力神将"}

不允许随机的地图 = {"秘境寻宝地图", "地下城市3层", "地下城市4层", "祖玛神殿7层","绝命谷","石阁6层","石阁7层",
	"蚂蚁洞穴","神舰地下1层","神舰地下3层","潘夜神殿","潘夜神殿9层西部","潘夜神殿9层东部","潘夜神殿10层",
	"潘夜石窟","潘夜石窟5层","真天宫东馆4层","真天宫北馆4层","真天宫北馆5层","诺玛遗址4层","诺玛遗址5层",
	"火影地牢3层","火影地牢4层","黑暗巢穴"
	}

每日任务统计 = {Date = 0, Count = 0}